{
  "intents": [
    {
      "Heading": "Welcome to Nutanix Licenses and Add-ons",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-managing-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "See also Nutanix Support Portal Licenses Page. The Nutanix corporate web site includes up-to-date information about AOS software editions.Which Section of the Licensing Guide Is For Me?Managing Licenses with 1-Click LicensingNutanix recommends that you configure 1-click licensing where possible by enabling the Portal Connection feature. Portal Connection simplifies license and add-on management by integrating the licensing workflow into a single interface in the web console. Once you enable this feature, you can perform most licensing tasks from Prism without needing to explicitly log on to the Nutanix Support Portal. It is disabled by default. To use it, see Configure 1-Click License Management and Manage Licenses with 1-Click Licensing.Manage Licenses ManuallyIf you do not want to enable 1-click licensing, you can manage licenses manually (also known informally as 3- Step Licensing). Enabled by default for your cluster, this licensing workflow is also appropriate for dark-site (non-Internet connected) deployments.To manage licenses manually, see Manage Licenses Manually.Apply Licenses to Individual Blocks in a ClusterYou can also apply licenses to individual blocks in a cluster. The Manual License Selection feature is available for licensing Prism Element or Prism Central clusters. You can apply licenses to individual blocks in a cluster. You can use this feature as part of the manual or dark-site licensing workflow (3-step licensing). The Nutanix support portal shows this feature on the licensing cards after you upload your cluster summary file.Depending on the product license you purchase, you apply it through the Prism Element or Prism Central web console. See Prism Element Cluster Licensing or Prism Central Licensing.Viewing License StatusThe most current information about your licenses is available from the Prism Element or Prism Central web console. It is also available at the Nutanix Support Portal from the Products link. You can view information about license levels, expiration dates, and any free license inventory (that is, unassigned available licenses). See Displaying License Features and Details.Products That Do Not Require a LicenseBefore You License Your ClusterRequirements and considerations for licensing.License CategoriesPrism Element Cluster LicensingPrism Central LicensingAOS Capacity-Based LicensingNutanix Calm LicensingPrism Pro LicenseAdd-On LicensesProducts That Do Not Require a LicenseNot all Nutanix software products require a license. Nutanix provides these products and their features without requiring you to do anything license-wise:Nutanix AHVKarbon (enabled through Prism Central)Prism Central (Prism Pro, however, requires a license for its advanced features, but you can manage registered Prism Element clusters with the base Prism Central software)Framework and utility software such as Life Cycle Manager (LCM), X-Ray, and MoveFoundationBefore You License Your ClusterRequirements and considerations for licensing.Consider the following before you attempt to manage your licenses.Before attempting to install a license, ensure that you have created a cluster and logged into the Prism Element web console at least once. You must install a license after creating a cluster for which you purchased Pro or Ultimate licenses for AOS.Before destroying a cluster, you must reclaim your licenses by unlicensing your cluster. You do not need to reclaim AOS Starter licenses for Nutanix and OEM AOS Appliance platforms. These licenses are embedded and are automatically applied whenever you create a cluster. You do need to reclaim AOS Pro and Ultimate licenses for these platforms.You do need to reclaim AOS licenses (Starter / Pro / Ultimate) for software-only and third-party hardware platforms.If a cluster includes nodes with different license levels (for example, Pro and Ultimate), the cluster and each node in the cluster defaults to the feature set enabled by the lowest license level. For example, if two nodes in the cluster have Ultimate licenses and two nodes in the same cluster have Pro licenses, all nodes effectively have Pro licenses and access to that feature set only. Attempts to access Ultimate features in this case result in a license noncompliance warning in the web console.License CategoriesSee the Nutanix corporate web site for the latest information about software licensing and the latest available platforms:Nutanix Software Editions and AOS Software Licensing ModelsNutanix Hardware Platforms and Dynamic SpecsheetNutanix generally categorizes licenses as follows:Nutanix and OEM AOS ApplianceIncludes Nutanix NX Series and OEM AOS platforms (such as Nutanix on HPE appliances, Nutanix on Dell EMC XC appliances, and so on).Delivered with an embedded default AOS Starter license, which does not expire.You can purchase AOS Pro, AOS Ultimate, and Add-On licenses.License is not transferable.You are not required to register this license on the Nutanix Customer Portal account assigned to you when you purchased your nodes. These licenses are automatically applied whenever you create a cluster, including after you have destroyed a cluster. You do not need to reclaim Starter licenses in this case.Your purchased license metric is life-of-device (LOD)Software-onlyPlatforms are qualified by Nutanix or by approved third-party vendors, such as Cisco UCS, Dell PowerEdge, and others.No license is embedded or delivered as a default, as you purchase hardware and licenses separately.You can purchase AOS Starter, Pro, or Ultimate, and Add-On licenses.Your purchased license metric is based on capacity based licensing (CBL), remote office/back office (ROBO), or virtual desktop infrastructure (VDI).Licenses are transferable.Third-party OEMIncludes OEM platforms qualified by Dell (Dell XC Series), Lenovo (Lenovo HX), and other vendors. No license is embedded or delivered as a default, as you purchase hardware and licenses separately.You can purchase AOS Starter, Pro, or Ultimate, and Add-On licenses.Your purchased license metric is based on capacity based licensing (CBL), remote office/back office (ROBO), or virtual desktop infrastructure (VDI).Licenses are transferable.Prism Element Cluster LicensingLicenses you can apply through the Prism Element web console include:AOS Starter, Pro, and Ultimate LicensesSee License Categories.Nutanix NX and OEM AOS Appliance platforms include an embedded Starter license as part of your purchase. It does not have to be downloaded and installed or otherwise applied to your cluster.Third-party OEM platforms require you to download and install a Starter license file that you have purchased.For all platforms: the AOS Pro and Ultimate license levels require you to install this license on your cluster. When you upgrade a license or add nodes or clusters to your environment, you must install the license.If you configure the Portal Connection as described in Manage Licenses with 1-Click Licensing, you can apply the license through the Prism Element web console without needing to log on to the support portal.If you do not want to enable this feature, you can manage licenses as described in Manage Prism Element Licenses and Manage Prism Central Licenses. This licensing workflow is also appropriate for dark-site (non-Internet connected or restricted connection) deployments.AOS Remote and Branch Office (ROBO) and Virtual Desktop Infrastructure per User (VDI) LicensesThe Nutanix corporate web site includes the latest information about these license models.AOS Capacity-Based LicensesCapacity-based licensing is the Nutanix licensing model where you purchase and apply licenses based on cluster attributes. Cluster attributes include the number of raw CPU cores and total raw Flash drive capacity in tebibytes (TiBs). See AOS Capacity-Based Licensing.Add-OnsYou can add individual features known as add-ons to your existing license feature set. When Nutanix makes add-ons available, you can add them to your existing license, depending on the license level and add-ons available for that license.See Add-On Licenses.Prism Central LicensingIf you configure the Portal Connection as described in Manage Licenses with 1-Click Licensing, you can apply licenses through the Prism Central web console without needing to log on to the support portal.If you do not want to enable this feature, you can manage licenses as described in Manage Prism Central Licenses. This licensing workflow is also appropriate for dark-site (non-Internet connected or restricted connection) deployments.Licenses you can apply through the Prism Central web console include:Prism ProThe Pro license for Prism Central adds additional capabilities to Prism Central, including custom dashboards, capacity planning, and advanced search capabilities.Add-OnsYou can add individual features known as add-ons to your existing license feature set. When Nutanix makes add-ons available, you can add them to your existing license, depending on the license level and add-ons available for that license.See Add-On Licenses.AOS Capacity-Based LicensingAOS capacity-based licensing is the Nutanix licensing model where you purchase and apply licenses based on cluster attributes. Cluster attributes include the number of raw CPU cores and raw total Flash drive capacity in tebibytes (TiBs). This licensing model helps ensure a consistent licensing experience across different platforms running Nutanix software.Each license stores the currently licensed capacity (CPU cores/Flash TiBs). If the capacity of the cluster increases, the web console informs you that additional licensing is required.Nutanix Calm LicensingThe Prism Central Guide and Nutanix Calm documentation describe how to enable Calm in Prism Central.The Nutanix Calm license for Prism Central enables you to manage the number of VMs that are provisioned or managed by Nutanix Calm. Calm licenses are required only for VMs managed by Calm, running in either the Nutanix Enterprise cloud or public clouds.The most current status information about your Calm licenses is available from the Prism Central web console. It is also available at the Nutanix Support Portal.Once Calm is enabled, Nutanix provides a free trial period of 60 days to use Calm. It might take up to 30 minutes to show that Calm is enabled and your trial period is started.Approximately 30 minutes after you enable Nutanix Calm, the Calm licensing card and licensing details show the trial expiration date. In Use status is displayed as Yes. See also Nutanix Calm License Warnings in the Web Console.How The Nutanix Calm License VM Count is CalculatedThe Nutanix Calm license VM count is a concurrent VM management limit and is linked to the application life cycle, from blueprint launch to application deletion. Consider the following:You launch a Nutanix Marketplace blueprint as an application named Example that includes three VMs. These three VMs are counted against your Calm license (that is, three VMs under Calm management).You later scale Example with two additional VMs. Now five VMs are under Calm management.You launch another blueprint as an application named Example2 with four new VMs. Total current number of VMs now under Calm management is nine (total from Example and Example2).You delete Example. Total current number of VMs now under Calm management is four (from the existing active Example2 deployment).Any VM you have created and are managing independently of Nutanix Calm is not part of the Calm license count. For example, you created a Windows guest OS VM through the Prism Element web console or with other tools (like a cloud-init script). This VM is not part of a Calm blueprint.However, if you import an existing VM into an existing Calm blueprint, that VM counts toward the Calm license. It counts until you delete the application deployment. If you stop the VM in this case and the application deployment is active, the VM is considered as under Calm management and part of the license count. Prism Pro LicenseThe Prism Pro license for Prism Central adds additional capabilities to Prism Central, including custom dashboards, capacity planning, and advanced search capabilities. Each new installation of Prism Central includes a 60-day trial, which you can disable if desired (see Disabling Prism Pro Features).Each node registered to and managed by Prism Pro requires the application of a Prism Pro license through the Prism Central web console. For example, if you have registered and are managing 10 Nutanix nodes (regardless of the individual node or cluster license level), you need to apply 10 Prism Pro licenses through the Prism Central web console. The workflow for applying a Prism Pro license in Prism Central is identical to the workflow for applying a license in a cluster. For example, the workflow for applying a license to an unlicensed Prism Central instance is the same as the workflow for licensing a node (without using Portal Connection):Purchase a Prism Pro license for each node managed by Prism Central.Generate a cluster summary file from the Prism Central web console.Upload the cluster summary file to the Nutanix Support Portal, then generate and download a license file.Apply the license file to Prism Central through its web console.Licensing dialog boxes and wizards subsequently show the license class is prism_central and the license level is Prism Pro.Add-On LicensesSee Installing or Configuring an Add-On License.Individual products known as add-ons can be added to your existing license feature set. When Nutanix makes add-ons available, you can add them to your existing license, depending on the license level and add-ons available for that licenseYou will need to purchase and apply one add-on license for each node in the cluster with a Pro license. For example, if your current Pro-licensed cluster consists of four nodes, you need to purchase four add-on licenses, then apply them to your cluster. All nodes in your cluster need to be at the same license level (four AOS Pro licenses and four add-on licenses). You cannot buy one add-on license, apply it to one node, and have three nodes without add-on licenses.Prism Element Add-OnsThe Nutanix corporate web site includes the latest information about these add-ons.Prism Element licensed add-on features include but are not limited to:Nutanix FilesNutanix Files is intended for enterprise file workloads within corporate datacenters, VDI environments, and at edge locations including remote/branch offices (ROBO). Files for AOS may be added to an existing AHV cluster whenthere is a mix of VM and file workloads. Files Dedicated should be deployed as a standalone Files cluster.Nutanix ObjectsNutanix Objects is intended for object storage use cases such as backup, archive and object storage for development. Objects for AOS may be added to an existing AHV cluster when there is a mix of VM and object storage workloads.  Objects Dedicated should be deployed as a standalone Objects cluster.Depending on your AOS license tier, available add-ons can include data encryption with Data-at-Rest Encryption (software-only and self-encrypting drives), disaster recovery with Nearsync or Sync Rep, and so on.Prism Central Add-OnsThe Nutanix corporate web site includes the latest information about these license models.Prism Central licensed add-on features include the following. See also Prism Pro.Nutanix CalmThe Nutanix Calm license for Prism Central enables you to manage the number of VMs that are provisioned or managed by Nutanix Calm. See Nutanix Calm Licensing.Nutanix FlowBy default, Nutanix Flow is disabled. Flow is a software-defined networking product tightly integrated into Nutanix AHV and Prism. Flow provides rich visualization, automation, and security for VMs running on AHV. Microsegmentation is a component of Flow networking that simplifies policy management. Using multiple Prism Central categories (logical groups), you can create a powerful distributed firewall that gives administrators an application-centric policy management tool for securing VM traffic."
    },
    {
      "Heading": "Products That Do Not Require a License",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-no-license-required-r.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Not all Nutanix software products require a license. Nutanix provides these products and their features without requiring you to do anything license-wise:Nutanix AHVKarbon (enabled through Prism Central)Prism Central (Prism Pro, however, requires a license for its advanced features, but you can manage registered Prism Element clusters with the base Prism Central software)Framework and utility software such as Life Cycle Manager (LCM), X-Ray, and MoveFoundation"
    },
    {
      "Heading": "Before You License Your Cluster",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-before-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Requirements and considerations for licensing.Consider the following before you attempt to manage your licenses.Before attempting to install a license, ensure that you have created a cluster and logged into the Prism Element web console at least once. You must install a license after creating a cluster for which you purchased Pro or Ultimate licenses for AOS.Before destroying a cluster, you must reclaim your licenses by unlicensing your cluster. You do not need to reclaim AOS Starter licenses for Nutanix and OEM AOS Appliance platforms. These licenses are embedded and are automatically applied whenever you create a cluster. You do need to reclaim AOS Pro and Ultimate licenses for these platforms.You do need to reclaim AOS licenses (Starter / Pro / Ultimate) for software-only and third-party hardware platforms.If a cluster includes nodes with different license levels (for example, Pro and Ultimate), the cluster and each node in the cluster defaults to the feature set enabled by the lowest license level. For example, if two nodes in the cluster have Ultimate licenses and two nodes in the same cluster have Pro licenses, all nodes effectively have Pro licenses and access to that feature set only. Attempts to access Ultimate features in this case result in a license noncompliance warning in the web console."
    },
    {
      "Heading": "License Categories",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-lic-categories-r.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "See the Nutanix corporate web site for the latest information about software licensing and the latest available platforms:Nutanix Software Editions and AOS Software Licensing ModelsNutanix Hardware Platforms and Dynamic SpecsheetNutanix generally categorizes licenses as follows:Nutanix and OEM AOS ApplianceIncludes Nutanix NX Series and OEM AOS platforms (such as Nutanix on HPE appliances, Nutanix on Dell EMC XC appliances, and so on).Delivered with an embedded default AOS Starter license, which does not expire.You can purchase AOS Pro, AOS Ultimate, and Add-On licenses.License is not transferable.You are not required to register this license on the Nutanix Customer Portal account assigned to you when you purchased your nodes. These licenses are automatically applied whenever you create a cluster, including after you have destroyed a cluster. You do not need to reclaim Starter licenses in this case.Your purchased license metric is life-of-device (LOD)Software-onlyPlatforms are qualified by Nutanix or by approved third-party vendors, such as Cisco UCS, Dell PowerEdge, and others.No license is embedded or delivered as a default, as you purchase hardware and licenses separately.You can purchase AOS Starter, Pro, or Ultimate, and Add-On licenses.Your purchased license metric is based on capacity based licensing (CBL), remote office/back office (ROBO), or virtual desktop infrastructure (VDI).Licenses are transferable.Third-party OEMIncludes OEM platforms qualified by Dell (Dell XC Series), Lenovo (Lenovo HX), and other vendors. No license is embedded or delivered as a default, as you purchase hardware and licenses separately.You can purchase AOS Starter, Pro, or Ultimate, and Add-On licenses.Your purchased license metric is based on capacity based licensing (CBL), remote office/back office (ROBO), or virtual desktop infrastructure (VDI).Licenses are transferable."
    },
    {
      "Heading": "Prism Element Cluster Licensing",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-prism-element-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Licenses you can apply through the Prism Element web console include:AOS Starter, Pro, and Ultimate LicensesSee License Categories.Nutanix NX and OEM AOS Appliance platforms include an embedded Starter license as part of your purchase. It does not have to be downloaded and installed or otherwise applied to your cluster.Third-party OEM platforms require you to download and install a Starter license file that you have purchased.For all platforms: the AOS Pro and Ultimate license levels require you to install this license on your cluster. When you upgrade a license or add nodes or clusters to your environment, you must install the license.If you configure the Portal Connection as described in Manage Licenses with 1-Click Licensing, you can apply the license through the Prism Element web console without needing to log on to the support portal.If you do not want to enable this feature, you can manage licenses as described in Manage Prism Element Licenses and Manage Prism Central Licenses. This licensing workflow is also appropriate for dark-site (non-Internet connected or restricted connection) deployments.AOS Remote and Branch Office (ROBO) and Virtual Desktop Infrastructure per User (VDI) LicensesThe Nutanix corporate web site includes the latest information about these license models.AOS Capacity-Based LicensesCapacity-based licensing is the Nutanix licensing model where you purchase and apply licenses based on cluster attributes. Cluster attributes include the number of raw CPU cores and total raw Flash drive capacity in tebibytes (TiBs). See AOS Capacity-Based Licensing.Add-OnsYou can add individual features known as add-ons to your existing license feature set. When Nutanix makes add-ons available, you can add them to your existing license, depending on the license level and add-ons available for that license.See Add-On Licenses."
    },
    {
      "Heading": "Prism Central Licensing",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-prism-central-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "If you configure the Portal Connection as described in Manage Licenses with 1-Click Licensing, you can apply licenses through the Prism Central web console without needing to log on to the support portal.If you do not want to enable this feature, you can manage licenses as described in Manage Prism Central Licenses. This licensing workflow is also appropriate for dark-site (non-Internet connected or restricted connection) deployments.Licenses you can apply through the Prism Central web console include:Prism ProThe Pro license for Prism Central adds additional capabilities to Prism Central, including custom dashboards, capacity planning, and advanced search capabilities.Add-OnsYou can add individual features known as add-ons to your existing license feature set. When Nutanix makes add-ons available, you can add them to your existing license, depending on the license level and add-ons available for that license.See Add-On Licenses."
    },
    {
      "Heading": "AOS Capacity-Based Licensing",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-capacity-based-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "AOS capacity-based licensing is the Nutanix licensing model where you purchase and apply licenses based on cluster attributes. Cluster attributes include the number of raw CPU cores and raw total Flash drive capacity in tebibytes (TiBs). This licensing model helps ensure a consistent licensing experience across different platforms running Nutanix software.Each license stores the currently licensed capacity (CPU cores/Flash TiBs). If the capacity of the cluster increases, the web console informs you that additional licensing is required."
    },
    {
      "Heading": "Nutanix Calm Licensing",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-calm-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "The Prism Central Guide and Nutanix Calm documentation describe how to enable Calm in Prism Central.The Nutanix Calm license for Prism Central enables you to manage the number of VMs that are provisioned or managed by Nutanix Calm. Calm licenses are required only for VMs managed by Calm, running in either the Nutanix Enterprise cloud or public clouds.The most current status information about your Calm licenses is available from the Prism Central web console. It is also available at the Nutanix Support Portal.Once Calm is enabled, Nutanix provides a free trial period of 60 days to use Calm. It might take up to 30 minutes to show that Calm is enabled and your trial period is started.Approximately 30 minutes after you enable Nutanix Calm, the Calm licensing card and licensing details show the trial expiration date. In Use status is displayed as Yes. See also Nutanix Calm License Warnings in the Web Console.How The Nutanix Calm License VM Count is CalculatedThe Nutanix Calm license VM count is a concurrent VM management limit and is linked to the application life cycle, from blueprint launch to application deletion. Consider the following:You launch a Nutanix Marketplace blueprint as an application named Example that includes three VMs. These three VMs are counted against your Calm license (that is, three VMs under Calm management).You later scale Example with two additional VMs. Now five VMs are under Calm management.You launch another blueprint as an application named Example2 with four new VMs. Total current number of VMs now under Calm management is nine (total from Example and Example2).You delete Example. Total current number of VMs now under Calm management is four (from the existing active Example2 deployment).Any VM you have created and are managing independently of Nutanix Calm is not part of the Calm license count. For example, you created a Windows guest OS VM through the Prism Element web console or with other tools (like a cloud-init script). This VM is not part of a Calm blueprint.However, if you import an existing VM into an existing Calm blueprint, that VM counts toward the Calm license. It counts until you delete the application deployment. If you stop the VM in this case and the application deployment is active, the VM is considered as under Calm management and part of the license count. "
    },
    {
      "Heading": "Prism Pro License",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-prism-pro-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "The Prism Pro license for Prism Central adds additional capabilities to Prism Central, including custom dashboards, capacity planning, and advanced search capabilities. Each new installation of Prism Central includes a 60-day trial, which you can disable if desired (see Disabling Prism Pro Features).Each node registered to and managed by Prism Pro requires the application of a Prism Pro license through the Prism Central web console. For example, if you have registered and are managing 10 Nutanix nodes (regardless of the individual node or cluster license level), you need to apply 10 Prism Pro licenses through the Prism Central web console. The workflow for applying a Prism Pro license in Prism Central is identical to the workflow for applying a license in a cluster. For example, the workflow for applying a license to an unlicensed Prism Central instance is the same as the workflow for licensing a node (without using Portal Connection):Purchase a Prism Pro license for each node managed by Prism Central.Generate a cluster summary file from the Prism Central web console.Upload the cluster summary file to the Nutanix Support Portal, then generate and download a license file.Apply the license file to Prism Central through its web console.Licensing dialog boxes and wizards subsequently show the license class is prism_central and the license level is Prism Pro."
    },
    {
      "Heading": "Add-On Licenses",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-addon-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "See Installing or Configuring an Add-On License.Individual products known as add-ons can be added to your existing license feature set. When Nutanix makes add-ons available, you can add them to your existing license, depending on the license level and add-ons available for that licenseYou will need to purchase and apply one add-on license for each node in the cluster with a Pro license. For example, if your current Pro-licensed cluster consists of four nodes, you need to purchase four add-on licenses, then apply them to your cluster. All nodes in your cluster need to be at the same license level (four AOS Pro licenses and four add-on licenses). You cannot buy one add-on license, apply it to one node, and have three nodes without add-on licenses.Prism Element Add-OnsThe Nutanix corporate web site includes the latest information about these add-ons.Prism Element licensed add-on features include but are not limited to:Nutanix FilesNutanix Files is intended for enterprise file workloads within corporate datacenters, VDI environments, and at edge locations including remote/branch offices (ROBO). Files for AOS may be added to an existing AHV cluster whenthere is a mix of VM and file workloads. Files Dedicated should be deployed as a standalone Files cluster.Nutanix ObjectsNutanix Objects is intended for object storage use cases such as backup, archive and object storage for development. Objects for AOS may be added to an existing AHV cluster when there is a mix of VM and object storage workloads.  Objects Dedicated should be deployed as a standalone Objects cluster.Depending on your AOS license tier, available add-ons can include data encryption with Data-at-Rest Encryption (software-only and self-encrypting drives), disaster recovery with Nearsync or Sync Rep, and so on.Prism Central Add-OnsThe Nutanix corporate web site includes the latest information about these license models.Prism Central licensed add-on features include the following. See also Prism Pro.Nutanix CalmThe Nutanix Calm license for Prism Central enables you to manage the number of VMs that are provisioned or managed by Nutanix Calm. See Nutanix Calm Licensing.Nutanix FlowBy default, Nutanix Flow is disabled. Flow is a software-defined networking product tightly integrated into Nutanix AHV and Prism. Flow provides rich visualization, automation, and security for VMs running on AHV. Microsegmentation is a component of Flow networking that simplifies policy management. Using multiple Prism Central categories (logical groups), you can create a powerful distributed firewall that gives administrators an application-centric policy management tool for securing VM traffic."
    },
    {
      "Heading": "Nutanix Support Portal Licenses Page",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-ntnx-support-portal-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Note: This topic assumes that you already have username and password credentials for the support portal.After you log on to the Nutanix support portal at https://portal.nutanix.com/, navigate to the Licenses page from from Quick Links > Licenses or the hamburger menu available from any page. Licenses provides access to these licensing landing pages:Summary. A license summary page including the Manage Licenses button. Manage Licenses enables you to get started with new licenses or administer existing licenses.Purchases. A table showing all your purchased licenses, shown in a table, with entries like License ID, Type, Expiration Date, and other information. If you are using tags, the portal displays tag names on the page and under Purchases on the left.Cluster Usage. A table showing all your licensed clusters, with entries like Cluster Name, License Type, Expiration Date, and other information. Includes the Manage Licenses button. Click the Cluster Name link to see cluster license details."
    },
    {
      "Heading": "Configure 1-Click License Management",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "The Nutanix Support Portal Connection API with the Prism web console Connect to Portal solution enables you to implement 1-click license management. It simplifies licensing by integrating the licensing workflow into a single interface in the web console. As this feature is disabled by default, you need to enable and configure it first.Note: Your network must allow outbound traffic to portal.nutanix.com:443 to use this feature. The 1-click license management solution simplifies licensing by integrating the licensing workflow into a single interface in the Prism Element and Prism Central web console. Once you configure this feature, you can perform most licensing tasks from the web console without needing to explicitly log on to the Nutanix Support Portal.The Portal Connection communicates with the Nutanix Support Portal to detect any changes or updates to your cluster license status. When you open Licensing from the web console, the screen displays 1-click action buttons to enable you to manage your licenses without leaving the web console.1-click license management requires you to first create and then register an API key to secure communications between the Nutanix Support Portal and the Prism Element or Prism Central web console.A Portal Connection API key is initially bound to the user that creates the key on the Nutanix Support Portal. All subsequent licensing operations are done on behalf of the user who created the key and any operations written to an audit log include information identifying this user. That is, licensing task X was performed by user Y (assuming user Y created the key).The Portal Connection API key is also bound to the Prism user that logs on to the web console and then registers the key. For example, if user admin registers the key, any licensing task performed by admin is performed on behalf of user Y (who created the key on the Support Portal). A Prism user (such as admin) must have access to the API key to use this feature. You can use Role Mapping and/or LDAP to manage key access or provide an audit trail if more than one admin user is going to manage licensing. You can create and register one or more keys per cluster. For example, create and register one key per user that will be administering licensing.Creating and Registering the Portal Connection API KeyCreate the Portal Connection API key on the Nutanix Support Portal, then register it through the Prism Element or Prism Central web console by using Connect to Portal. You might need to turn off any pop-up blockers in your browser to display dialog boxes.Disabling 1-Click License ManagementDisables the Portal Connection (including deleting API keys) through the Prism web console.Revoking the Portal Connection API KeyRevoke the API key on the Nutanix Support Portal, which disables the Portal Connection feature in the Prism web console.Updating the Portal Connection API KeyThis procedure assumes you have already configured Portal Connection and have a working connection (that is, you have not disabled it). You might need to update the Portal Connection API key associated with your profile. First get a new key and apply, then optionally revoke the existing key.Creating and Registering the Portal Connection API KeyCreate the Portal Connection API key on the Nutanix Support Portal, then register it through the Prism Element or Prism Central web console by using Connect to Portal. You might need to turn off any pop-up blockers in your browser to display dialog boxes.Log on to the Nutanix Support Portal, select API Keys from your profile, then click New API Key.Figure. Generating API Keys in the Support PortalClick to enlargeGenerate the key in the Create New API Key dialog box.Enter an alias (name) for the key to help you identify or keep track of the key on the portal, then click Generate.Copy the new key, then click X to close the dialog box.Note: After you copy the key and close the dialog, this key becomes unavailable. It cannot be retrieved.Figure. Entering an API Key Alias NameClick to enlargeOptionally, click Download SSL Public Key for use when you register the API key in the web console.Register the API key through the Prism Element or Prism Central web console.Log on to the web console, click the gear icon, then click Licensing.Click Connect to Portal at the top banner in the Licensing page.Paste the API key in the API KEY field in the Portal Connection dialog box. Optionally, add a public key by clicking Choose File and browsing to the public key file you optionally downloaded in the previous step.Click Save.The Portal connection has been created and Fetching licensing data messages are displayed. You can also register the API key by updating your user profile by selecting your user profile icon, then clicking Update Profile. Figure. Connect to Portal DialogClick to enlargeFigure. Register the API Key (Update Profile)Click to enlargeDisabling 1-Click License ManagementDisables the Portal Connection (including deleting API keys) through the Prism web console.You might need to disable the Portal Connection or revoke the API key associated with it. If you disable the connection as described here, you can enable it again by obtaining a new API key as described in Creating and Registering the Portal Connection API Key. For security reasons, you cannot reuse your previously-created API key after disabling the Portal Connection.Log on to the Prism web console.Click the user icon in the main menu, then select Update Profile.Click Disable in the Portal Connection section. The status becomes disconnected.Click Save.Figure. Disable the Portal ConnectionClick to enlargeRevoking the Portal Connection API KeyRevoke the API key on the Nutanix Support Portal, which disables the Portal Connection feature in the Prism web console.You might need to revoke the API key associated with the Portal Connection. After revoking the key:You will need to create and register a new key to continue using the Portal Connection licensing feature.The connection between the Support Portal and the Prism web console is broken (disconnected).You might see a red connection state with a message of Error: Invalid API Key in the Update Profile dialog box.Log in to the Nutanix Support Portal and select API Keys from your profile.The API Keys page is displayed. Figure. API Keys Portal PageClick to enlargeLocate your key alias name, click Revoke, and then click the confirmation.Updating the Portal Connection API KeyThis procedure assumes you have already configured Portal Connection and have a working connection (that is, you have not disabled it). You might need to update the Portal Connection API key associated with your profile. First get a new key and apply, then optionally revoke the existing key.Log on to the Nutanix Support Portal, select API Keys from your profile, then click New API Key.Figure. Generating API Keys in the Support PortalClick to enlargeGenerate the key in the Create New API Key dialog box.Enter an alias (name) for the key to help you identify or keep track of the key on the portal, then click Generate.Copy the new key, then click X to close the dialog box.Note: After you copy the key and close the dialog, this key becomes unavailable. It cannot be retrieved.Figure. Entering an API Key Alias NameClick to enlargeOptionally, click Download SSL Public Key for use when you register the API key in the web console.Update the API key through the Prism web console.Click the user icon in the main menu, then select Update Profile.Click Update in the Portal Connection section.Paste the API key in the API KEY field in the dialog box. Optionally, paste the downloaded public key in the PUBLIC KEY field.Click Save.Figure. Update the API KeyClick to enlargeOptionally, you can revoke other keys associated with the Portal Connection. See Revoking the Portal Connection API Key."
    },
    {
      "Heading": "Creating and Registering the Portal Connection API Key",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-create-reg-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Create the Portal Connection API key on the Nutanix Support Portal, then register it through the Prism Element or Prism Central web console by using Connect to Portal. You might need to turn off any pop-up blockers in your browser to display dialog boxes.Log on to the Nutanix Support Portal, select API Keys from your profile, then click New API Key.Figure. Generating API Keys in the Support PortalClick to enlargeGenerate the key in the Create New API Key dialog box.Enter an alias (name) for the key to help you identify or keep track of the key on the portal, then click Generate.Copy the new key, then click X to close the dialog box.Note: After you copy the key and close the dialog, this key becomes unavailable. It cannot be retrieved.Figure. Entering an API Key Alias NameClick to enlargeOptionally, click Download SSL Public Key for use when you register the API key in the web console.Register the API key through the Prism Element or Prism Central web console.Log on to the web console, click the gear icon, then click Licensing.Click Connect to Portal at the top banner in the Licensing page.Paste the API key in the API KEY field in the Portal Connection dialog box. Optionally, add a public key by clicking Choose File and browsing to the public key file you optionally downloaded in the previous step.Click Save.The Portal connection has been created and Fetching licensing data messages are displayed. You can also register the API key by updating your user profile by selecting your user profile icon, then clicking Update Profile. Figure. Connect to Portal DialogClick to enlargeFigure. Register the API Key (Update Profile)Click to enlarge"
    },
    {
      "Heading": "Disabling 1-Click License Management",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-disable-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Disables the Portal Connection (including deleting API keys) through the Prism web console.You might need to disable the Portal Connection or revoke the API key associated with it. If you disable the connection as described here, you can enable it again by obtaining a new API key as described in Creating and Registering the Portal Connection API Key. For security reasons, you cannot reuse your previously-created API key after disabling the Portal Connection.Log on to the Prism web console.Click the user icon in the main menu, then select Update Profile.Click Disable in the Portal Connection section. The status becomes disconnected.Click Save.Figure. Disable the Portal ConnectionClick to enlarge"
    },
    {
      "Heading": "Revoking the Portal Connection API Key",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-revoke-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Revoke the API key on the Nutanix Support Portal, which disables the Portal Connection feature in the Prism web console.You might need to revoke the API key associated with the Portal Connection. After revoking the key:You will need to create and register a new key to continue using the Portal Connection licensing feature.The connection between the Support Portal and the Prism web console is broken (disconnected).You might see a red connection state with a message of Error: Invalid API Key in the Update Profile dialog box.Log in to the Nutanix Support Portal and select API Keys from your profile.The API Keys page is displayed. Figure. API Keys Portal PageClick to enlargeLocate your key alias name, click Revoke, and then click the confirmation."
    },
    {
      "Heading": "Updating the Portal Connection API Key",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-update-key-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "This procedure assumes you have already configured Portal Connection and have a working connection (that is, you have not disabled it). You might need to update the Portal Connection API key associated with your profile. First get a new key and apply, then optionally revoke the existing key.Log on to the Nutanix Support Portal, select API Keys from your profile, then click New API Key.Figure. Generating API Keys in the Support PortalClick to enlargeGenerate the key in the Create New API Key dialog box.Enter an alias (name) for the key to help you identify or keep track of the key on the portal, then click Generate.Copy the new key, then click X to close the dialog box.Note: After you copy the key and close the dialog, this key becomes unavailable. It cannot be retrieved.Figure. Entering an API Key Alias NameClick to enlargeOptionally, click Download SSL Public Key for use when you register the API key in the web console.Update the API key through the Prism web console.Click the user icon in the main menu, then select Update Profile.Click Update in the Portal Connection section.Paste the API key in the API KEY field in the dialog box. Optionally, paste the downloaded public key in the PUBLIC KEY field.Click Save.Figure. Update the API KeyClick to enlargeOptionally, you can revoke other keys associated with the Portal Connection. See Revoking the Portal Connection API Key."
    },
    {
      "Heading": "Manage Licenses with 1-Click Licensing",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-managing-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "The Portal Connection API provides 1-click licensing. It simplifies licensing by integrating the licensing workflow into a single interface in the web console. As this feature is disabled by default, enable and configure it first.The Portal Connection feature simplifies licensing by integrating the licensing workflow into a single interface in the web console. Once you configure this feature, you can perform most licensing tasks from the Prism web console without needing to explicitly log on to the Nutanix Support Portal.Portal Connection communicates with the Nutanix Support Portal to detect any changes or updates to your cluster license status. When you open Licensing from the web console, the screen displays 1-click action buttons to enable you to manage your licenses without leaving the web console.Before You BeginSee Configure 1-Click License Management.Your network must allow outbound traffic to portal.nutanix.com:443 to use this feature. Updating an expired license or extending the expiration date of an existing license can be a manual process that does not require the Portal Connection feature. See Example: Updating a License (1-Click).1-Click Licensing Action ButtonsWhen you open Licensing from the Prism web console, the screen displays 1-click action buttons to enable you to manage your licenses without leaving the web console. Depending on your current licensing status and cluster configuration, you might see one or more of these 1-click action buttons.Example: Upgrading Your Starter Cluster to Pro (1-Click)Example: Renewing a License (1-Click)In this example, Portal Connection is configured and the customer has purchased new Pro licenses for a cluster with expired Pro licenses.Example: Removing An Add-on Feature (1-Click)Reclaiming Licenses (1-Click)Example: Updating a License (1-Click)In this example, Portal Connection is configured and the customer has extended existing Pro licenses for a cluster. That is, the expiration date for existing licences has been extended before the licenses have expired.1-Click Licensing Action ButtonsWhen you open Licensing from the Prism web console, the screen displays 1-click action buttons to enable you to manage your licenses without leaving the web console. Depending on your current licensing status and cluster configuration, you might see one or more of these 1-click action buttons.Table 1. 1-Click Licensing Action ButtonsThis Button Appears...If You Are Eligible or Want To...AddAdd an add-on license. This button appears if add-on features are available for licensing.DowngradeDowngrade your cluster to Pro from Ultimate or to Starter from Pro or Ultimate. Use this button when reclaiming licenses before destroying a cluster.RebalanceEnsure your available licenses are applied to each node in your cluster. For example:If you have added a node and have an available license in your account, click Rebalance.If you have removed a node, click Rebalance to reclaim the now-unused license.RemoveRemove an add-on license, disabling the add-on feature.RenewApplies newly-purchased licenses.SelectEnables you to apply a license for an unlicensed cluster.UpdateExtends the expiration data of current valid licenses. UpgradeUpgrade your cluster from Starter to Pro or Ultimate, or Pro to Ultimate license types.Example: Upgrading Your Starter Cluster to Pro (1-Click)In this example, 1-click licensing is configured in this Starter-licensed cluster and the customer has purchased Pro licenses for a Starter-licensed cluster.Open Licensing from the gear icon in the Prism web console for the connected cluster.The Licensing window shows that you have Pro licenses available (that you have purchased and detected by Portal Connection) because the Upgrade to Pro button is highlighted. You can click Contact Sales to buy that add-on feature.Click Upgrade to Pro.Figure. Upgrading to ProClick to enlargeAOS is automatically performing each step, including contacting the Support Portal to download a license file, and then applying the license. After applying the license, the window displays a Successfully applied licenses message. Click X to close the Licensing window.Example: Renewing a License (1-Click)In this example, Portal Connection is configured and the customer has purchased new Pro licenses for a cluster with expired Pro licenses.Downgrade your cluster to renew your licenses and then apply the renewed licenses.In the web console, click the gear icon, and select Licensing.Because the license has expired, you can also Downgrade to Starter if you did not purchase new licenses.Click Renew to apply the new Pro licenses.AOS is automatically performing each step, including contacting the Support Portal to download a license file, and then applying the license. After applying the license, the window displays a Successfully applied licenses message. Click X to close the Licensing window.Example: Removing An Add-on Feature (1-Click)In this example, 1-click licensing (Portal Connection+Connect to Portal) is configured in this Pro-licensed cluster and the customer had previously purchased an add-on feature license. Here, the customer removes this feature.Open Licensing from the gear icon in the Prism web console for the connected cluster.The Licensing window shows that you have installed the Nutanix Files add-on. You can click Contact Sales to buy add-on features or licenses.Click Remove Nutanix Files to remove this add-on feature. Click Yes in the confirmation window.Portal Connection places the cluster into standby mode to remove the feature and update the cluster license status. After this operation is complete, license status is updated.Click X to close the Licensing window.Reclaiming Licenses (1-Click)Before you beginNote: If you have destroyed the cluster and did not reclaim the existing licenses (except for Starter licenses), contact Nutanix Support to help reclaim the licenses. The Acropolis Advanced Administration Guide describes how to destroy a cluster. See Reclaiming Licenses to reclaim licenses where the cluster is not configured with 1-click licensing (Portal Connection) or the cluster is not connected to the internet (also known as dark-site clusters).You can reclaim and optionally re-apply licenses for nodes in your clusters when using Portal Connection.Before destroying a cluster, you must reclaim your licenses by unlicensing your cluster. You do not need to reclaim AOS Starter licenses for Nutanix and OEM AOS Appliance platforms. These licenses are embedded and are automatically applied whenever you create a cluster. You do need to reclaim AOS Pro and Ultimate licenses for these platforms.You do need to reclaim AOS licenses (Starter / Pro / Ultimate) for software-only and third-party hardware platforms.Reclaim licenses to return them to your inventory when you remove one or more nodes from a cluster. If you move nodes from one cluster to another, first reclaim the licenses, move the nodes, then re-apply the licenses. Otherwise, if you are removing a node and not moving it to another cluster, use the Rebalance button.You can reclaim licenses for nodes in your clusters in cases where you want to make modifications or downgrade licenses. For example, applying an Ultimate license to all nodes in a cluster where some nodes are currently licensed as Pro and some nodes are licensed as Ultimate. You might also want to transition nodes from Ultimate to Pro licensing.Open Licensing from the gear icon in the web console for the connected cluster.Remove any add-ons as described in Example: Removing An Add-on Feature (1-Click).Click Downgrade to Starter after any add-ons are removed.Click X to close the Licensing window.You can now perform any additional tasks, such as destroying the cluster or re-applying licenses.Example: Updating a License (1-Click)In this example, Portal Connection is configured and the customer has extended existing Pro licenses for a cluster. That is, the expiration date for existing licences has been extended before the licenses have expired.Update your cluster to apply the new license expiration date.Open Licensing from the gear icon in the Prism Element web console for the connected cluster.Click Update to extend the expiration date of the existing Pro licenses.AOS is automatically performing each step, including contacting the Support Portal to download a license file, and then applying the license. After applying the license updates, the window displays a Successfully applied licenses message. Click Show Licenses to ensure the new expiration date has been applied.Click X to close the Licensing window."
    },
    {
      "Heading": "1-Click Licensing Action Buttons",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-buttons-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "When you open Licensing from the Prism web console, the screen displays 1-click action buttons to enable you to manage your licenses without leaving the web console. Depending on your current licensing status and cluster configuration, you might see one or more of these 1-click action buttons.Table 1. 1-Click Licensing Action ButtonsThis Button Appears...If You Are Eligible or Want To...AddAdd an add-on license. This button appears if add-on features are available for licensing.DowngradeDowngrade your cluster to Pro from Ultimate or to Starter from Pro or Ultimate. Use this button when reclaiming licenses before destroying a cluster.RebalanceEnsure your available licenses are applied to each node in your cluster. For example:If you have added a node and have an available license in your account, click Rebalance.If you have removed a node, click Rebalance to reclaim the now-unused license.RemoveRemove an add-on license, disabling the add-on feature.RenewApplies newly-purchased licenses.SelectEnables you to apply a license for an unlicensed cluster.UpdateExtends the expiration data of current valid licenses. UpgradeUpgrade your cluster from Starter to Pro or Ultimate, or Pro to Ultimate license types."
    },
    {
      "Heading": "Example: Upgrading Your Starter Cluster to Pro (1-Click)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-upgrade-pro-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "In this example, 1-click licensing is configured in this Starter-licensed cluster and the customer has purchased Pro licenses for a Starter-licensed cluster.Open Licensing from the gear icon in the Prism web console for the connected cluster.The Licensing window shows that you have Pro licenses available (that you have purchased and detected by Portal Connection) because the Upgrade to Pro button is highlighted. You can click Contact Sales to buy that add-on feature.Click Upgrade to Pro.Figure. Upgrading to ProClick to enlargeAOS is automatically performing each step, including contacting the Support Portal to download a license file, and then applying the license. After applying the license, the window displays a Successfully applied licenses message. Click X to close the Licensing window."
    },
    {
      "Heading": "Example: Renewing a License (1-Click)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-renew-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "In this example, Portal Connection is configured and the customer has purchased new Pro licenses for a cluster with expired Pro licenses.Downgrade your cluster to renew your licenses and then apply the renewed licenses.In the web console, click the gear icon, and select Licensing.Because the license has expired, you can also Downgrade to Starter if you did not purchase new licenses.Click Renew to apply the new Pro licenses.AOS is automatically performing each step, including contacting the Support Portal to download a license file, and then applying the license. After applying the license, the window displays a Successfully applied licenses message. Click X to close the Licensing window."
    },
    {
      "Heading": "Example: Removing An Add-on Feature (1-Click)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-remove-addon-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "In this example, 1-click licensing (Portal Connection+Connect to Portal) is configured in this Pro-licensed cluster and the customer had previously purchased an add-on feature license. Here, the customer removes this feature.Open Licensing from the gear icon in the Prism web console for the connected cluster.The Licensing window shows that you have installed the Nutanix Files add-on. You can click Contact Sales to buy add-on features or licenses.Click Remove Nutanix Files to remove this add-on feature. Click Yes in the confirmation window.Portal Connection places the cluster into standby mode to remove the feature and update the cluster license status. After this operation is complete, license status is updated.Click X to close the Licensing window."
    },
    {
      "Heading": "Reclaiming Licenses (1-Click)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-reclaim-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Before you beginNote: If you have destroyed the cluster and did not reclaim the existing licenses (except for Starter licenses), contact Nutanix Support to help reclaim the licenses. The Acropolis Advanced Administration Guide describes how to destroy a cluster. See Reclaiming Licenses to reclaim licenses where the cluster is not configured with 1-click licensing (Portal Connection) or the cluster is not connected to the internet (also known as dark-site clusters).You can reclaim and optionally re-apply licenses for nodes in your clusters when using Portal Connection.Before destroying a cluster, you must reclaim your licenses by unlicensing your cluster. You do not need to reclaim AOS Starter licenses for Nutanix and OEM AOS Appliance platforms. These licenses are embedded and are automatically applied whenever you create a cluster. You do need to reclaim AOS Pro and Ultimate licenses for these platforms.You do need to reclaim AOS licenses (Starter / Pro / Ultimate) for software-only and third-party hardware platforms.Reclaim licenses to return them to your inventory when you remove one or more nodes from a cluster. If you move nodes from one cluster to another, first reclaim the licenses, move the nodes, then re-apply the licenses. Otherwise, if you are removing a node and not moving it to another cluster, use the Rebalance button.You can reclaim licenses for nodes in your clusters in cases where you want to make modifications or downgrade licenses. For example, applying an Ultimate license to all nodes in a cluster where some nodes are currently licensed as Pro and some nodes are licensed as Ultimate. You might also want to transition nodes from Ultimate to Pro licensing.Open Licensing from the gear icon in the web console for the connected cluster.Remove any add-ons as described in Example: Removing An Add-on Feature (1-Click).Click Downgrade to Starter after any add-ons are removed.Click X to close the Licensing window.You can now perform any additional tasks, such as destroying the cluster or re-applying licenses."
    },
    {
      "Heading": "Example: Updating a License (1-Click)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-portal-connection-update-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "In this example, Portal Connection is configured and the customer has extended existing Pro licenses for a cluster. That is, the expiration date for existing licences has been extended before the licenses have expired.Update your cluster to apply the new license expiration date.Open Licensing from the gear icon in the Prism Element web console for the connected cluster.Click Update to extend the expiration date of the existing Pro licenses.AOS is automatically performing each step, including contacting the Support Portal to download a license file, and then applying the license. After applying the license updates, the window displays a Successfully applied licenses message. Click Show Licenses to ensure the new expiration date has been applied.Click X to close the Licensing window."
    },
    {
      "Heading": "Using Tags to Organize Your Licenses",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-tags-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "On the Products > Licenses > Purchases page on the Nutanix support portal, you can label your licenses with a tag to conveniently group them.Tags help provide more granularity and ease of use to your license management. Tags are especially handy if you use the Manual License Selection workflow. For example, you can apply a tag to licenses to group them according to:A common expiration dateUse case (clusters used by remote offices)Assigned organization (clusters used by an engineering department)When you tag one or more licenses, you can then:Sort them by tag name on the support portalPerform license actions (on the portal) on clusters grouped by tag (especially when selecting licenses manually)When you click Purchases, the page displays existing tags. To view licenses associate with each tag, click a tag in the sidebar to display those licenses only.Figure. License Tag ListClick to enlargeAdding a Tag to Your LicensesLabel your licenses with a tag to conveniently group them. You can add multiple tags to a single license. Removing a Tag from a LicenseDeleting a TagAdding a Tag to Your LicensesLabel your licenses with a tag to conveniently group them. You can add multiple tags to a single license.  Log on to the Nutanix Support Portal, then click Products > Licenses > Purchases.The portal displays a sortable table listing your purchased licenses. You can sort the table by clicking any table heading (License ID, Type, License Class, and so on).To add a new tag:Select the checkbox next to the licenses you want to tag, then click Add Tag.Add Tag is only available when you select at least one license.In the select tag or create new field, enter a new tag name.Click create new label:.The support portal web page refreshes and displays your tagged licenses. The tag name is displayed under Purchases.To apply one or more existing tags:Select the checkbox next to the licenses you want to tag, then click Add Tag.Select one or more existing tags.Click Apply.Figure. Apply An Existing TagClick to enlargeThe support portal web page refreshes and displays your tagged licenses.Removing a Tag from a LicenseThis procedure describes how to remove a tag from a license (that is, how to untag it).Note: To delete an existing tag, which also removes the tag from any licenses where it is applied, see Deleting a Tag. Log on to the Nutanix Support Portal, then click Products > Licenses > Purchases.The portal displays a sortable table listing your purchased licenses. You can sort the table by clicking any table heading (License ID, Type, License Class, and so on). When you click Purchases, the page displays existing tags on the left sidebar.Figure. License Tag ListClick to enlarge Click a tag name in the sidebar to display those licenses only.Select the licenses with the tag you want to untag, then click Remove. Select at least one license to display Remove.The support portal web page refreshes and displays your tagged and untagged licenses.Deleting a TagThis procedure enables you to delete an existing tag, which also removes the tag from any licenses where it is applied. Note: To remove tags from individual licenses (that is, untag licensed clusters) without deleting the tag itself, see Removing a Tag from a License.If you accidentally delete a tag, recreate it as a new tag and apply it. See Adding a Tag to Your Licenses. Log on to the Nutanix Support Portal, then click Products > Licenses > Purchases.The portal displays a sortable table listing your purchased licenses. You can sort the table by clicking any table heading (License ID, Type, License Class, and so on). When you click Purchases, the page displays existing tags.Figure. License Tag ListClick to enlarge Click a tag name. The portal lists the tagged licenses.Click Delete Tag.The existing tag is deleted, which also removes the tag from any licenses where it is applied. The portal removes the tag from the list.Figure. License Tag List - DeletedClick to enlarge"
    },
    {
      "Heading": "Adding a Tag to Your Licenses",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-tags-add-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Label your licenses with a tag to conveniently group them. You can add multiple tags to a single license.  Log on to the Nutanix Support Portal, then click Products > Licenses > Purchases.The portal displays a sortable table listing your purchased licenses. You can sort the table by clicking any table heading (License ID, Type, License Class, and so on).To add a new tag:Select the checkbox next to the licenses you want to tag, then click Add Tag.Add Tag is only available when you select at least one license.In the select tag or create new field, enter a new tag name.Click create new label:.The support portal web page refreshes and displays your tagged licenses. The tag name is displayed under Purchases.To apply one or more existing tags:Select the checkbox next to the licenses you want to tag, then click Add Tag.Select one or more existing tags.Click Apply.Figure. Apply An Existing TagClick to enlargeThe support portal web page refreshes and displays your tagged licenses."
    },
    {
      "Heading": "Removing a Tag from a License",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-tags-remove-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "This procedure describes how to remove a tag from a license (that is, how to untag it).Note: To delete an existing tag, which also removes the tag from any licenses where it is applied, see Deleting a Tag. Log on to the Nutanix Support Portal, then click Products > Licenses > Purchases.The portal displays a sortable table listing your purchased licenses. You can sort the table by clicking any table heading (License ID, Type, License Class, and so on). When you click Purchases, the page displays existing tags on the left sidebar.Figure. License Tag ListClick to enlarge Click a tag name in the sidebar to display those licenses only.Select the licenses with the tag you want to untag, then click Remove. Select at least one license to display Remove.The support portal web page refreshes and displays your tagged and untagged licenses."
    },
    {
      "Heading": "Deleting a Tag",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-tags-delete-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "This procedure enables you to delete an existing tag, which also removes the tag from any licenses where it is applied. Note: To remove tags from individual licenses (that is, untag licensed clusters) without deleting the tag itself, see Removing a Tag from a License.If you accidentally delete a tag, recreate it as a new tag and apply it. See Adding a Tag to Your Licenses. Log on to the Nutanix Support Portal, then click Products > Licenses > Purchases.The portal displays a sortable table listing your purchased licenses. You can sort the table by clicking any table heading (License ID, Type, License Class, and so on). When you click Purchases, the page displays existing tags.Figure. License Tag ListClick to enlarge Click a tag name. The portal lists the tagged licenses.Click Delete Tag.The existing tag is deleted, which also removes the tag from any licenses where it is applied. The portal removes the tag from the list.Figure. License Tag List - DeletedClick to enlarge"
    },
    {
      "Heading": "Manage Licenses Manually",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-lic-manage-manual-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "If you do not want to enable 1-click licensing, you can manage licenses manually (also known informally as 3- Step Licensing). Enabled by default for your cluster, this licensing workflow is also appropriate for dark-site (non-Internet connected) deployments.Manage Prism Element LicensesManage Prism Central LicensesOther Common License Management Tasks3-Step Licensing and Downloading a Cluster Summary File3- Step Licensing3-Step Licensing refers to most manual licensing procedures (that is, where 1-Click Licensing is not enabled). These procedures describe the 3-Step Licensing procedure (in more detail), where you:In the Prism Element or Prism Central web console, download a cluster summary file, then upload it to the Nutanix Support portalDownload a license file from the Nutanix Support portalIn the Prism Element of Prism Central web console, apply the license file on a cluster connected to the InternetDownloading a Cluster Summary File From Your ClusterLog on to your Prism Element or Prism Central cluster web console and download a cluster summary file which you can upload to the Nutanix Support portal to update your cluster license status. Keep this web console page open in your browser to complete the licensing process. This task is used for all Prism Element and Prism Central manual licensing work flows when you are managing licenses without Portal Connection but your cluster is connected to the internet.Note: Generating a cluster summary file through the web console, nCLI commands (license generate-cluster-info), or PowerShell commands (Get-NTNXClusterLicenseInfo and Get-NTNXClusterLicenseInfoFile) initiates the cluster licensing process. You might observe a Licensing Status: In Process alert message in the web console or log files in this case.For an internet-connected cluster, log on to your Prism Element or Prism Central web console.Click the gear icon, then select Licensing in the Settings panel.Click Update License, then click Download to create and save a cluster summary file to your local machine.The cluster summary file is saved to your browser download folder or a folder you specify.What to do nextUpload the cluster summary file to the Nutanix Support portal. See Manage Prism Element Licenses or Manage Prism Central LicensesGetting Cluster Summary Information ManuallyGet information about your cluster in the web console, which you can enter at the Nutanix Support portal to update your cluster license status. You typically perform this step for dark-site clusters, which are not usually connected to the Internet.Log on to your Prism Element or Prism Central web console.Click the gear icon, then select Licensing in the Settings panel.Click Update License, then click Expand to show the cluster summary information needed to download a license file to your local machine.Get your cluster information from the web console.Click Show Info and copy the cluster information needed to generate a license file.Figure. Cluster Information Needed for LicensingClick to enlargeThe page displays information that you need to enter at the support portal on an internet-connected system. Copy this information needed to complete this licensing procedure.Cluster UUIDString indicating the unique cluster IDSignatureCluster security keyLicense ClassIndicates a software-only, appliance-based, or Prism Central license classLicense VersionIndicates the version of the installed license fileNode CountNumber of available licenses for this modelCores / Cores NumNumber of CPU cores; used with capacity-based licensingFlash TiBNumber of Flash TiBs; used with capacity based licensingHDD TiBNumber of hard disk drive (HDD) TiBs; used with capacity based licensingBlock IDID number of the Nutanix blockWhat to do nextUpload the cluster summary file to the Nutanix Support portal. See Manage Prism Element Licenses or Manage Prism Central LicensesManage Prism Element LicensesAOS is installed or upgraded with the Portal Connection disabled by default. If you do not want to enable this feature, you can manage licenses as described in these topics.You can perform the licensing procedures described in these topics from a cluster Prism Element web console.See also Products That Do Not Require a License.Managing Licenses with Portal Connection EnabledIf you want to enable Portal Connection, you can manage licenses as described in these topics instead:Configure 1-Click License ManagementManage Licenses with 1-Click LicensingInstalling a New License (Including Add-Ons)Select and then manually install a license on Internet-connected clusters not using the Portal Connection API. Installing a New License (Dark Site, Including Add-Ons)Manually install a license on a dark-site cluster that is not connected to the Internet and cannot contact the Nutanix Support Portal.Installing an Updated License After Adding a Node to a ClusterAfter you have added a node to your cluster, you must install a new updated license file. Installing a New License (Including Add-Ons)Select and then manually install a license on Internet-connected clusters not using the Portal Connection API. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See also:Nutanix Support Portal Licenses PageInstalling or Configuring an Add-On LicenseManual License SelectionProducts That Do Not Require a License.Download a cluster summary file in the Prism Element web console. See Downloading a Cluster Summary File From Your Cluster.Keep the Prism Element web console page open in your browser to complete the licensing process.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Adding a Tag to Your Licenses, select the tag name orAll Licenses in the Choose License Tags drop-down menu.Click Upload File, browse to the cluster summary file you downloaded and select it. Then clickNext.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.Click Select License in theAcropolis card.Select a License Level such as Pro or Ultimate from the drop-down menu.Click Save.The Acropolis card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Nutanix Files are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.Figure. Example Add-on CardClick to enlargeThe card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Element or Prism Central web console, click theUpload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks.Installing a New License (Dark Site, Including Add-Ons)Manually install a license on a dark-site cluster that is not connected to the Internet and cannot contact the Nutanix Support Portal.This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See alsoNutanix Support Portal Licenses Page.Note: You can use Option 1 shown in the web console Manage Licensing page to generate a cluster summary file and copy that file to a machine connected to the Internet to upload to the Nutanix Support Portal to get a license file. However, as dark-site systems are not connected to the Internet to adhere to regulatory, security, or compliance policies at the customer site, this procedure describes the manual entry of cluster information.Get your cluster information from the web console. See Getting Cluster Summary Information Manually.Keep the dark-site web console page open in your browser to complete the licensing process.Now do the following steps on a machine connected to the Internet.Log on to the Nutanix support portal and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Adding a Tag to Your Licenses, select the tag name or All Licenses in the Choose License Tags drop-down menu.Click Dark Site.Figure. Dark Site License Page Example Click to enlargeDo the following.Select a License Class: Appliance, Software Only, Prism Central, or n/a.Select a License Version.Select an AOS Version.Enter the Cluster UUID and Signature in the text fields.Click Next.Enter capacity and block details if necessary.Enter the number of CPU cores and Flash/HDD storage in TiBs.Click Add Block to add details about each block in the cluster.Model. For example, NX-3175-G5.Block ID, which is the block serial number.Number of nodes, typically 1 per block.Click Add Block to add the block, then clickAdd Block to add another block.Continue until you have added all blocks.Click Next.Click Select License in theAcropolis card.Select a License Level such as Pro or Ultimate from the drop-down menu.Click Save.The Acropolis card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Nutanix Files are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.The card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.From the dark-site Prism Element web console, apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console of the unconnected cluster.Click Manage Licenses, then click theUpload link. Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.The Prism web console Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks.Installing an Updated License After Adding a Node to a ClusterAfter you have added a node to your cluster, you must install a new updated license file. The procedure for installing an updated license is identical to the procedure described in Installing a New License (Including Add-Ons) or Installing a New License (Dark Site, Including Add-Ons).What to do nextSee Displaying License Features and DetailsManage Prism Central LicensesPerform the licensing procedures described in these topics from a Prism Central web console for:Prism ProNutanix CalmNutanix FilesObjectsSee also Products That Do Not Require a License.Installing a New Prism Central License (Including Add-Ons)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API. Installing a New Prism Central License (Including Add-Ons) (Dark Site)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API that can contact the Nutanix Support Portal. Disabling Prism Pro FeaturesHow to disable the Prism Pro features (and remove the violating license message that appears in Prism Central if the Prism Pro features are enabled without a valid license).Installing a New Prism Central License (Including Add-Ons)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See also Nutanix Support Portal Licenses Page and Installing or Configuring an Add-On License.Generate a cluster summary file in the Prism Central web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.Click Select License in the Prism Central card.Select a License Level such as Prism Pro from the drop-down menu.Select the number of nodes that will be managed by Prism Central. You can over-provision the number of nodes for future cluster expansion.Click Save.The Prism Central card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Calm or Flow are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.Click Save.Figure. Select Licenses Page Example , Prism CentralClick to enlargeThe card now shows the highlighted license status and the Manage License link.Click Next to see Summary page of any license to be updated on your Prism Central cluster.Repeat to select additional add-on licenses.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Central web console, click the Upload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks.Installing a New Prism Central License (Including Add-Ons) (Dark Site)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API that can contact the Nutanix Support Portal. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure:Generate and upload a cluster summary file to the Nutanix support portal.On a machine connected to the Internet, generate and download a license file from the support portal.Install the license on the cluster that is not connected to the Internet (that is, a dark site).Note: You can use Option 1 shown in the web console Manage Licensing page to generate a cluster summary file and copy that file to a machine connected to the Internet to upload to the Nutanix Support Portal to get a license file. However, as dark-site systems are not connected to the Internet to adhere to regulatory, security, or compliance policies at the customer site, this procedure describes the manual entry of cluster information. See also Nutanix Support Portal Licenses Page.Get your cluster information from the web console. See Getting Cluster Summary Information Manually.Now do the following steps on a machine connected to the Internet.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickDark Sites.Do the following.Select a License Class Prism Central.Select a License Version.Select an AOS Version.Enter the Cluster UUID and Signature in the text fields.Click Next.Enter capacity for Flow and Calm, and block details if necessary.Enter the number of Flow protected nodes and required Calm packs.Click Add Block to add details about each block in the cluster.Model. For example, NX-3175-G5. You can leave this field empty if it is not present in your cluster information.Number of nodes, typically 1 per block.Click Add Block to add the block, then clickAdd Block to add another block.Continue until you have added all blocks.Click Next.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Calm, select the number of VM packs. Click Save.The card now shows the highlighted license status and theManage License link.Click Next to see the Summary page of any license to be updated on your Prism Central cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Central web console, click the upload link in the Manage Licenses dialog box. See Getting Cluster Summary Information Manually.Browse to the license file you downloaded, select it, and clickSave.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and DetailsDisabling Prism Pro FeaturesHow to disable the Prism Pro features (and remove the violating license message that appears in Prism Central if the Prism Pro features are enabled without a valid license).Log on to Prism Central, click the gear icon, and select Licensing.In the Licensing page, click the license icon.Figure. Prism Licensing PageClick to enlargeIn the Prism Pro License Features page, clear (uncheck) Enable all features.A message box appears stating the operation requires that you log out and then log back in to see the results. Click the Continue button. This immediately logs you out of Prism Central and returns you to the login page. When you log back in, the Prism Pro features are disabled.To re-enable Prism Pro, repeat this process but select Enable all features.Figure. Prism License Features PageClick to enlargeOther Common License Management TasksThis section describes some common licensing tasks like unlicensing, reclaiming licenses, and so on.Installing or Configuring an Add-On LicenseUpgrading, Extending, or Downgrading Licenses or Add-OnsInstall a newly-purchased license to upgrade your license tier, downgrade a license tier, or extend the licensing term on your cluster or nodes.Reclaiming LicensesReclaim a license by returning it to your inventory when modifying license assignments or after removing a node from a cluster. Unlicensing a Cluster or Add-onInstalling or Configuring an Add-On LicenseAfter you have purchased one or more Prism Element add-ons, you must install and configure a new updated license file. This procedure describes how to do this on a cluster connected to the Internet and describes the 3-Step Licensing procedure.You can also configure add-on features that you did not configure when originally installing your license.See also Nutanix Support Portal Licenses Page.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.Your available add-ons are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not include the Data Encryption add-on feature.Figure. Select Licenses Page Example Click to enlargeLicense each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.Figure. Example Add-on CardClick to enlargeThe card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the web console, click the upload link in theManage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave.ResultsThe Licensing dialog box displays all license details for the cluster.What to do nextSee Displaying License Features and DetailsUpgrading, Extending, or Downgrading Licenses or Add-OnsInstall a newly-purchased license to upgrade your license tier, downgrade a license tier, or extend the licensing term on your cluster or nodes.Unlicense your cluster.Install the new license(s).Unlicense your cluster as described in Unlicensing a Cluster or Add-on.Do not destroy your cluster. Once you complete this procedure, your cluster license level is Starter.Install the new licenses and optionally any add-ons as described in:Manage Prism Element Licenses and Manage Prism Central LicensesResultsThe Prism Element or Prism Central web console Licensing dialog box shows all new license details for the cluster.Reclaiming LicensesReclaim a license by returning it to your inventory when modifying license assignments or after removing a node from a cluster. You can reclaim and optionally re-apply licenses for nodes in your clusters. This procedure describes how to reclaim licenses where the cluster is not configured with Portal Connection or the cluster is not connected to the internet (also known as dark-site clusters).After you remove a node, you can also move the node to another cluster. Doing so requires using an available license in your inventory. See Installing an Updated License After Adding a Node to a Cluster.You must unlicense your cluster (other than Starter on Nutanix NX Series platforms) when you plan to destroy a cluster. First unlicense the cluster, then destroy the cluster. See Unlicensing a Cluster or Add-on.Return licenses to your inventory when you remove one or more nodes from a cluster. Also, if you move nodes from one cluster to another, first reclaim the licenses, move the nodes, then re-apply the licenses. You can reclaim licenses for nodes in your clusters in cases where you want to make modifications or downgrade licenses. For example, applying an Ultimate license to all nodes in a cluster where some nodes are currently licensed as Pro and some nodes are licensed as Ultimate. You might also want to transition nodes from Ultimate to Pro licensing. See Upgrading, Extending, or Downgrading Licenses or Add-Ons.You do not need to reclaim Starter licenses for Nutanix NX Series platforms. These licenses are automatically applied whenever you create a cluster. Reclaiming Licenses When Destroying a ClusterBefore you beginIf you have destroyed the cluster and did not reclaim all existing licenses by unlicensing the cluster, contact Nutanix Support to help reclaim the licenses. TheAcropolis Advanced Administration Guide describes how to destroy a cluster.See Unlicensing a Cluster or Add-on.Reclaiming Licenses When Removing Nodes from a ClusterBefore you beginThe Prism Web Console Guide cluster management topics describe how to remove a node from a cluster.Remove a node from a cluster.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.Reclaim licenses by unlicensing the cluster by clickingUnlicense All, then clickUnlicense in the pop-up dialog box.Click Next.The cluster licensing status shows Reclaimed.Figure. Reclaimed License Status.Click to enlargeClick Download License File to download the license file created for the cluster to your browser download folder or directory you specify.Apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console.Click Manage Licenses, then click theupload link. Browse to the license file you downloaded, select it, and clickSave.Unlicensing a Cluster or Add-onRemove licenses or add-ons from the Prism Element or Prism Central cluster and refund available licenses that have not expired to your account (that is, reclaim all licenses). An unlicensed Nutanix NX Series cluster reverts to the default Starter license.You must unlicense your cluster when you plan to destroy a cluster. First unlicense the cluster as described here, then destroy the cluster.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then click Upload File.In the dialog box, browse to the cluster summary file you just generated and select it.Unlicense a cluster or add-on.To completely unlicense a cluster and all add-ons, click Unlicense All, then click Unlicense in the pop-up dialog box.To unlicense an add-on, click the add-on's options menu, click Unlicense then click Unlicense in the pop-up dialog box.Figure. Unlicense Add-OnClick to enlargeClick Next.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.Apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console.Click Manage Licenses, then click the upload link. Browse to the license file you downloaded, select it, and click Save.[Optional] Destroy the cluster. Do not do this step if you are upgrading or downgrading licenses.The Acropolis Advanced Administration Guide describes how to destroy a cluster."
    },
    {
      "Heading": "3-Step Licensing and Downloading a Cluster Summary File",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:3-Step%20Licensing%20and%20Downloading%20a%20Cluster%20Summary%20File",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "3- Step Licensing3-Step Licensing refers to most manual licensing procedures (that is, where 1-Click Licensing is not enabled). These procedures describe the 3-Step Licensing procedure (in more detail), where you:In the Prism Element or Prism Central web console, download a cluster summary file, then upload it to the Nutanix Support portalDownload a license file from the Nutanix Support portalIn the Prism Element of Prism Central web console, apply the license file on a cluster connected to the InternetDownloading a Cluster Summary File From Your ClusterLog on to your Prism Element or Prism Central cluster web console and download a cluster summary file which you can upload to the Nutanix Support portal to update your cluster license status. Keep this web console page open in your browser to complete the licensing process. This task is used for all Prism Element and Prism Central manual licensing work flows when you are managing licenses without Portal Connection but your cluster is connected to the internet.Note: Generating a cluster summary file through the web console, nCLI commands (license generate-cluster-info), or PowerShell commands (Get-NTNXClusterLicenseInfo and Get-NTNXClusterLicenseInfoFile) initiates the cluster licensing process. You might observe a Licensing Status: In Process alert message in the web console or log files in this case.For an internet-connected cluster, log on to your Prism Element or Prism Central web console.Click the gear icon, then select Licensing in the Settings panel.Click Update License, then click Download to create and save a cluster summary file to your local machine.The cluster summary file is saved to your browser download folder or a folder you specify.What to do nextUpload the cluster summary file to the Nutanix Support portal. See Manage Prism Element Licenses or Manage Prism Central LicensesGetting Cluster Summary Information ManuallyGet information about your cluster in the web console, which you can enter at the Nutanix Support portal to update your cluster license status. You typically perform this step for dark-site clusters, which are not usually connected to the Internet.Log on to your Prism Element or Prism Central web console.Click the gear icon, then select Licensing in the Settings panel.Click Update License, then click Expand to show the cluster summary information needed to download a license file to your local machine.Get your cluster information from the web console.Click Show Info and copy the cluster information needed to generate a license file.Figure. Cluster Information Needed for LicensingClick to enlargeThe page displays information that you need to enter at the support portal on an internet-connected system. Copy this information needed to complete this licensing procedure.Cluster UUIDString indicating the unique cluster IDSignatureCluster security keyLicense ClassIndicates a software-only, appliance-based, or Prism Central license classLicense VersionIndicates the version of the installed license fileNode CountNumber of available licenses for this modelCores / Cores NumNumber of CPU cores; used with capacity-based licensingFlash TiBNumber of Flash TiBs; used with capacity based licensingHDD TiBNumber of hard disk drive (HDD) TiBs; used with capacity based licensingBlock IDID number of the Nutanix blockWhat to do nextUpload the cluster summary file to the Nutanix Support portal. See Manage Prism Element Licenses or Manage Prism Central Licenses"
    },
    {
      "Heading": "3- Step Licensing",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-three-step-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "3-Step Licensing refers to most manual licensing procedures (that is, where 1-Click Licensing is not enabled). These procedures describe the 3-Step Licensing procedure (in more detail), where you:In the Prism Element or Prism Central web console, download a cluster summary file, then upload it to the Nutanix Support portalDownload a license file from the Nutanix Support portalIn the Prism Element of Prism Central web console, apply the license file on a cluster connected to the Internet"
    },
    {
      "Heading": "Downloading a Cluster Summary File From Your Cluster",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-generate-cluster-summary-file-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Log on to your Prism Element or Prism Central cluster web console and download a cluster summary file which you can upload to the Nutanix Support portal to update your cluster license status. Keep this web console page open in your browser to complete the licensing process. This task is used for all Prism Element and Prism Central manual licensing work flows when you are managing licenses without Portal Connection but your cluster is connected to the internet.Note: Generating a cluster summary file through the web console, nCLI commands (license generate-cluster-info), or PowerShell commands (Get-NTNXClusterLicenseInfo and Get-NTNXClusterLicenseInfoFile) initiates the cluster licensing process. You might observe a Licensing Status: In Process alert message in the web console or log files in this case.For an internet-connected cluster, log on to your Prism Element or Prism Central web console.Click the gear icon, then select Licensing in the Settings panel.Click Update License, then click Download to create and save a cluster summary file to your local machine.The cluster summary file is saved to your browser download folder or a folder you specify.What to do nextUpload the cluster summary file to the Nutanix Support portal. See Manage Prism Element Licenses or Manage Prism Central Licenses"
    },
    {
      "Heading": "Manage Prism Element Licenses",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-lic-manage-prism-element-licenses.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "AOS is installed or upgraded with the Portal Connection disabled by default. If you do not want to enable this feature, you can manage licenses as described in these topics.You can perform the licensing procedures described in these topics from a cluster Prism Element web console.See also Products That Do Not Require a License.Managing Licenses with Portal Connection EnabledIf you want to enable Portal Connection, you can manage licenses as described in these topics instead:Configure 1-Click License ManagementManage Licenses with 1-Click LicensingInstalling a New License (Including Add-Ons)Select and then manually install a license on Internet-connected clusters not using the Portal Connection API. Installing a New License (Dark Site, Including Add-Ons)Manually install a license on a dark-site cluster that is not connected to the Internet and cannot contact the Nutanix Support Portal.Installing an Updated License After Adding a Node to a ClusterAfter you have added a node to your cluster, you must install a new updated license file. Installing a New License (Including Add-Ons)Select and then manually install a license on Internet-connected clusters not using the Portal Connection API. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See also:Nutanix Support Portal Licenses PageInstalling or Configuring an Add-On LicenseManual License SelectionProducts That Do Not Require a License.Download a cluster summary file in the Prism Element web console. See Downloading a Cluster Summary File From Your Cluster.Keep the Prism Element web console page open in your browser to complete the licensing process.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Adding a Tag to Your Licenses, select the tag name orAll Licenses in the Choose License Tags drop-down menu.Click Upload File, browse to the cluster summary file you downloaded and select it. Then clickNext.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.Click Select License in theAcropolis card.Select a License Level such as Pro or Ultimate from the drop-down menu.Click Save.The Acropolis card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Nutanix Files are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.Figure. Example Add-on CardClick to enlargeThe card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Element or Prism Central web console, click theUpload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks.Installing a New License (Dark Site, Including Add-Ons)Manually install a license on a dark-site cluster that is not connected to the Internet and cannot contact the Nutanix Support Portal.This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See alsoNutanix Support Portal Licenses Page.Note: You can use Option 1 shown in the web console Manage Licensing page to generate a cluster summary file and copy that file to a machine connected to the Internet to upload to the Nutanix Support Portal to get a license file. However, as dark-site systems are not connected to the Internet to adhere to regulatory, security, or compliance policies at the customer site, this procedure describes the manual entry of cluster information.Get your cluster information from the web console. See Getting Cluster Summary Information Manually.Keep the dark-site web console page open in your browser to complete the licensing process.Now do the following steps on a machine connected to the Internet.Log on to the Nutanix support portal and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Adding a Tag to Your Licenses, select the tag name or All Licenses in the Choose License Tags drop-down menu.Click Dark Site.Figure. Dark Site License Page Example Click to enlargeDo the following.Select a License Class: Appliance, Software Only, Prism Central, or n/a.Select a License Version.Select an AOS Version.Enter the Cluster UUID and Signature in the text fields.Click Next.Enter capacity and block details if necessary.Enter the number of CPU cores and Flash/HDD storage in TiBs.Click Add Block to add details about each block in the cluster.Model. For example, NX-3175-G5.Block ID, which is the block serial number.Number of nodes, typically 1 per block.Click Add Block to add the block, then clickAdd Block to add another block.Continue until you have added all blocks.Click Next.Click Select License in theAcropolis card.Select a License Level such as Pro or Ultimate from the drop-down menu.Click Save.The Acropolis card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Nutanix Files are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.The card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.From the dark-site Prism Element web console, apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console of the unconnected cluster.Click Manage Licenses, then click theUpload link. Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.The Prism web console Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks.Installing an Updated License After Adding a Node to a ClusterAfter you have added a node to your cluster, you must install a new updated license file. The procedure for installing an updated license is identical to the procedure described in Installing a New License (Including Add-Ons) or Installing a New License (Dark Site, Including Add-Ons).What to do nextSee Displaying License Features and Details"
    },
    {
      "Heading": "Installing a New License (Including Add-Ons)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-install-new-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Select and then manually install a license on Internet-connected clusters not using the Portal Connection API. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See also:Nutanix Support Portal Licenses PageInstalling or Configuring an Add-On LicenseManual License SelectionProducts That Do Not Require a License.Download a cluster summary file in the Prism Element web console. See Downloading a Cluster Summary File From Your Cluster.Keep the Prism Element web console page open in your browser to complete the licensing process.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Adding a Tag to Your Licenses, select the tag name orAll Licenses in the Choose License Tags drop-down menu.Click Upload File, browse to the cluster summary file you downloaded and select it. Then clickNext.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.Click Select License in theAcropolis card.Select a License Level such as Pro or Ultimate from the drop-down menu.Click Save.The Acropolis card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Nutanix Files are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.Figure. Example Add-on CardClick to enlargeThe card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Element or Prism Central web console, click theUpload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks."
    },
    {
      "Heading": "Installing a New License (Dark Site, Including Add-Ons)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-install-new-unconnected-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Manually install a license on a dark-site cluster that is not connected to the Internet and cannot contact the Nutanix Support Portal.This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See alsoNutanix Support Portal Licenses Page.Note: You can use Option 1 shown in the web console Manage Licensing page to generate a cluster summary file and copy that file to a machine connected to the Internet to upload to the Nutanix Support Portal to get a license file. However, as dark-site systems are not connected to the Internet to adhere to regulatory, security, or compliance policies at the customer site, this procedure describes the manual entry of cluster information.Get your cluster information from the web console. See Getting Cluster Summary Information Manually.Keep the dark-site web console page open in your browser to complete the licensing process.Now do the following steps on a machine connected to the Internet.Log on to the Nutanix support portal and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Adding a Tag to Your Licenses, select the tag name or All Licenses in the Choose License Tags drop-down menu.Click Dark Site.Figure. Dark Site License Page Example Click to enlargeDo the following.Select a License Class: Appliance, Software Only, Prism Central, or n/a.Select a License Version.Select an AOS Version.Enter the Cluster UUID and Signature in the text fields.Click Next.Enter capacity and block details if necessary.Enter the number of CPU cores and Flash/HDD storage in TiBs.Click Add Block to add details about each block in the cluster.Model. For example, NX-3175-G5.Block ID, which is the block serial number.Number of nodes, typically 1 per block.Click Add Block to add the block, then clickAdd Block to add another block.Continue until you have added all blocks.Click Next.Click Select License in theAcropolis card.Select a License Level such as Pro or Ultimate from the drop-down menu.Click Save.The Acropolis card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Nutanix Files are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.The card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.From the dark-site Prism Element web console, apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console of the unconnected cluster.Click Manage Licenses, then click theUpload link. Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.The Prism web console Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks."
    },
    {
      "Heading": "Installing an Updated License After Adding a Node to a Cluster",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-regenerating-file-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "After you have added a node to your cluster, you must install a new updated license file. The procedure for installing an updated license is identical to the procedure described in Installing a New License (Including Add-Ons) or Installing a New License (Dark Site, Including Add-Ons).What to do nextSee Displaying License Features and Details"
    },
    {
      "Heading": "Manage Prism Central Licenses",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-lic-manage-prism-central-licenses.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Perform the licensing procedures described in these topics from a Prism Central web console for:Prism ProNutanix CalmNutanix FilesObjectsSee also Products That Do Not Require a License.Installing a New Prism Central License (Including Add-Ons)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API. Installing a New Prism Central License (Including Add-Ons) (Dark Site)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API that can contact the Nutanix Support Portal. Disabling Prism Pro FeaturesHow to disable the Prism Pro features (and remove the violating license message that appears in Prism Central if the Prism Pro features are enabled without a valid license).Installing a New Prism Central License (Including Add-Ons)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See also Nutanix Support Portal Licenses Page and Installing or Configuring an Add-On License.Generate a cluster summary file in the Prism Central web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.Click Select License in the Prism Central card.Select a License Level such as Prism Pro from the drop-down menu.Select the number of nodes that will be managed by Prism Central. You can over-provision the number of nodes for future cluster expansion.Click Save.The Prism Central card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Calm or Flow are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.Click Save.Figure. Select Licenses Page Example , Prism CentralClick to enlargeThe card now shows the highlighted license status and the Manage License link.Click Next to see Summary page of any license to be updated on your Prism Central cluster.Repeat to select additional add-on licenses.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Central web console, click the Upload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks.Installing a New Prism Central License (Including Add-Ons) (Dark Site)Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API that can contact the Nutanix Support Portal. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure:Generate and upload a cluster summary file to the Nutanix support portal.On a machine connected to the Internet, generate and download a license file from the support portal.Install the license on the cluster that is not connected to the Internet (that is, a dark site).Note: You can use Option 1 shown in the web console Manage Licensing page to generate a cluster summary file and copy that file to a machine connected to the Internet to upload to the Nutanix Support Portal to get a license file. However, as dark-site systems are not connected to the Internet to adhere to regulatory, security, or compliance policies at the customer site, this procedure describes the manual entry of cluster information. See also Nutanix Support Portal Licenses Page.Get your cluster information from the web console. See Getting Cluster Summary Information Manually.Now do the following steps on a machine connected to the Internet.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickDark Sites.Do the following.Select a License Class Prism Central.Select a License Version.Select an AOS Version.Enter the Cluster UUID and Signature in the text fields.Click Next.Enter capacity for Flow and Calm, and block details if necessary.Enter the number of Flow protected nodes and required Calm packs.Click Add Block to add details about each block in the cluster.Model. For example, NX-3175-G5. You can leave this field empty if it is not present in your cluster information.Number of nodes, typically 1 per block.Click Add Block to add the block, then clickAdd Block to add another block.Continue until you have added all blocks.Click Next.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Calm, select the number of VM packs. Click Save.The card now shows the highlighted license status and theManage License link.Click Next to see the Summary page of any license to be updated on your Prism Central cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Central web console, click the upload link in the Manage Licenses dialog box. See Getting Cluster Summary Information Manually.Browse to the license file you downloaded, select it, and clickSave.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and DetailsDisabling Prism Pro FeaturesHow to disable the Prism Pro features (and remove the violating license message that appears in Prism Central if the Prism Pro features are enabled without a valid license).Log on to Prism Central, click the gear icon, and select Licensing.In the Licensing page, click the license icon.Figure. Prism Licensing PageClick to enlargeIn the Prism Pro License Features page, clear (uncheck) Enable all features.A message box appears stating the operation requires that you log out and then log back in to see the results. Click the Continue button. This immediately logs you out of Prism Central and returns you to the login page. When you log back in, the Prism Pro features are disabled.To re-enable Prism Pro, repeat this process but select Enable all features.Figure. Prism License Features PageClick to enlarge"
    },
    {
      "Heading": "Installing a New Prism Central License (Including Add-Ons)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-install-new-pc-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure. See also Nutanix Support Portal Licenses Page and Installing or Configuring an Add-On License.Generate a cluster summary file in the Prism Central web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not have the Data Encryption add-on feature.Click Select License in the Prism Central card.Select a License Level such as Prism Pro from the drop-down menu.Select the number of nodes that will be managed by Prism Central. You can over-provision the number of nodes for future cluster expansion.Click Save.The Prism Central card now shows the license level, a highlighted license status, and the Manage Licenses link. Your available add-ons like Calm or Flow are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.Click Save.Figure. Select Licenses Page Example , Prism CentralClick to enlargeThe card now shows the highlighted license status and the Manage License link.Click Next to see Summary page of any license to be updated on your Prism Central cluster.Repeat to select additional add-on licenses.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Central web console, click the Upload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks."
    },
    {
      "Heading": "Installing a New Prism Central License (Including Add-Ons) (Dark Site)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-install-new-pc-dark-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Manually install a Prism Central license on Internet-connected clusters not using the Portal Connection API that can contact the Nutanix Support Portal. This procedure assumes you have purchased licenses and describes the 3-Step Licensing procedure:Generate and upload a cluster summary file to the Nutanix support portal.On a machine connected to the Internet, generate and download a license file from the support portal.Install the license on the cluster that is not connected to the Internet (that is, a dark site).Note: You can use Option 1 shown in the web console Manage Licensing page to generate a cluster summary file and copy that file to a machine connected to the Internet to upload to the Nutanix Support Portal to get a license file. However, as dark-site systems are not connected to the Internet to adhere to regulatory, security, or compliance policies at the customer site, this procedure describes the manual entry of cluster information. See also Nutanix Support Portal Licenses Page.Get your cluster information from the web console. See Getting Cluster Summary Information Manually.Now do the following steps on a machine connected to the Internet.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickDark Sites.Do the following.Select a License Class Prism Central.Select a License Version.Select an AOS Version.Enter the Cluster UUID and Signature in the text fields.Click Next.Enter capacity for Flow and Calm, and block details if necessary.Enter the number of Flow protected nodes and required Calm packs.Click Add Block to add details about each block in the cluster.Model. For example, NX-3175-G5. You can leave this field empty if it is not present in your cluster information.Number of nodes, typically 1 per block.Click Add Block to add the block, then clickAdd Block to add another block.Continue until you have added all blocks.Click Next.License each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Calm, select the number of VM packs. Click Save.The card now shows the highlighted license status and theManage License link.Click Next to see the Summary page of any license to be updated on your Prism Central cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the Prism Central web console, click the upload link in the Manage Licenses dialog box. See Getting Cluster Summary Information Manually.Browse to the license file you downloaded, select it, and clickSave.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details"
    },
    {
      "Heading": "Disabling Prism Pro Features",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-prism-pro-disable-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "How to disable the Prism Pro features (and remove the violating license message that appears in Prism Central if the Prism Pro features are enabled without a valid license).Log on to Prism Central, click the gear icon, and select Licensing.In the Licensing page, click the license icon.Figure. Prism Licensing PageClick to enlargeIn the Prism Pro License Features page, clear (uncheck) Enable all features.A message box appears stating the operation requires that you log out and then log back in to see the results. Click the Continue button. This immediately logs you out of Prism Central and returns you to the login page. When you log back in, the Prism Pro features are disabled.To re-enable Prism Pro, repeat this process but select Enable all features.Figure. Prism License Features PageClick to enlarge"
    },
    {
      "Heading": "Other Common License Management Tasks",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-lic-other-license-tasks-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "This section describes some common licensing tasks like unlicensing, reclaiming licenses, and so on.Installing or Configuring an Add-On LicenseUpgrading, Extending, or Downgrading Licenses or Add-OnsInstall a newly-purchased license to upgrade your license tier, downgrade a license tier, or extend the licensing term on your cluster or nodes.Reclaiming LicensesReclaim a license by returning it to your inventory when modifying license assignments or after removing a node from a cluster. Unlicensing a Cluster or Add-onInstalling or Configuring an Add-On LicenseAfter you have purchased one or more Prism Element add-ons, you must install and configure a new updated license file. This procedure describes how to do this on a cluster connected to the Internet and describes the 3-Step Licensing procedure.You can also configure add-on features that you did not configure when originally installing your license.See also Nutanix Support Portal Licenses Page.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.Your available add-ons are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not include the Data Encryption add-on feature.Figure. Select Licenses Page Example Click to enlargeLicense each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.Figure. Example Add-on CardClick to enlargeThe card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the web console, click the upload link in theManage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave.ResultsThe Licensing dialog box displays all license details for the cluster.What to do nextSee Displaying License Features and DetailsUpgrading, Extending, or Downgrading Licenses or Add-OnsInstall a newly-purchased license to upgrade your license tier, downgrade a license tier, or extend the licensing term on your cluster or nodes.Unlicense your cluster.Install the new license(s).Unlicense your cluster as described in Unlicensing a Cluster or Add-on.Do not destroy your cluster. Once you complete this procedure, your cluster license level is Starter.Install the new licenses and optionally any add-ons as described in:Manage Prism Element Licenses and Manage Prism Central LicensesResultsThe Prism Element or Prism Central web console Licensing dialog box shows all new license details for the cluster.Reclaiming LicensesReclaim a license by returning it to your inventory when modifying license assignments or after removing a node from a cluster. You can reclaim and optionally re-apply licenses for nodes in your clusters. This procedure describes how to reclaim licenses where the cluster is not configured with Portal Connection or the cluster is not connected to the internet (also known as dark-site clusters).After you remove a node, you can also move the node to another cluster. Doing so requires using an available license in your inventory. See Installing an Updated License After Adding a Node to a Cluster.You must unlicense your cluster (other than Starter on Nutanix NX Series platforms) when you plan to destroy a cluster. First unlicense the cluster, then destroy the cluster. See Unlicensing a Cluster or Add-on.Return licenses to your inventory when you remove one or more nodes from a cluster. Also, if you move nodes from one cluster to another, first reclaim the licenses, move the nodes, then re-apply the licenses. You can reclaim licenses for nodes in your clusters in cases where you want to make modifications or downgrade licenses. For example, applying an Ultimate license to all nodes in a cluster where some nodes are currently licensed as Pro and some nodes are licensed as Ultimate. You might also want to transition nodes from Ultimate to Pro licensing. See Upgrading, Extending, or Downgrading Licenses or Add-Ons.You do not need to reclaim Starter licenses for Nutanix NX Series platforms. These licenses are automatically applied whenever you create a cluster. Reclaiming Licenses When Destroying a ClusterBefore you beginIf you have destroyed the cluster and did not reclaim all existing licenses by unlicensing the cluster, contact Nutanix Support to help reclaim the licenses. TheAcropolis Advanced Administration Guide describes how to destroy a cluster.See Unlicensing a Cluster or Add-on.Reclaiming Licenses When Removing Nodes from a ClusterBefore you beginThe Prism Web Console Guide cluster management topics describe how to remove a node from a cluster.Remove a node from a cluster.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.Reclaim licenses by unlicensing the cluster by clickingUnlicense All, then clickUnlicense in the pop-up dialog box.Click Next.The cluster licensing status shows Reclaimed.Figure. Reclaimed License Status.Click to enlargeClick Download License File to download the license file created for the cluster to your browser download folder or directory you specify.Apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console.Click Manage Licenses, then click theupload link. Browse to the license file you downloaded, select it, and clickSave.Unlicensing a Cluster or Add-onRemove licenses or add-ons from the Prism Element or Prism Central cluster and refund available licenses that have not expired to your account (that is, reclaim all licenses). An unlicensed Nutanix NX Series cluster reverts to the default Starter license.You must unlicense your cluster when you plan to destroy a cluster. First unlicense the cluster as described here, then destroy the cluster.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then click Upload File.In the dialog box, browse to the cluster summary file you just generated and select it.Unlicense a cluster or add-on.To completely unlicense a cluster and all add-ons, click Unlicense All, then click Unlicense in the pop-up dialog box.To unlicense an add-on, click the add-on's options menu, click Unlicense then click Unlicense in the pop-up dialog box.Figure. Unlicense Add-OnClick to enlargeClick Next.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.Apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console.Click Manage Licenses, then click the upload link. Browse to the license file you downloaded, select it, and click Save.[Optional] Destroy the cluster. Do not do this step if you are upgrading or downgrading licenses.The Acropolis Advanced Administration Guide describes how to destroy a cluster."
    },
    {
      "Heading": "Installing or Configuring an Add-On License",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-install-new-addon-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "After you have purchased one or more Prism Element add-ons, you must install and configure a new updated license file. This procedure describes how to do this on a cluster connected to the Internet and describes the 3-Step Licensing procedure.You can also configure add-on features that you did not configure when originally installing your license.See also Nutanix Support Portal Licenses Page.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then clickUpload File.In the dialog box, browse to the cluster summary file you just generated and select it.Your available add-ons are shown with a Select License link. Add-ons not associated with your account appear greyed-out or unavailable. For example, your license level might not include the Data Encryption add-on feature.Figure. Select Licenses Page Example Click to enlargeLicense each add-on by clicking Select License under the add-on card.Configure that license, if necessary.For example, for Nutanix Files, enter the licensed storage in TiB (tebibytes). Click Save.Figure. Example Add-on CardClick to enlargeThe card now shows the highlighted license status and theManage Licenses link.Click Next to see Summary page of licenses to be updated on your cluster.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.In the web console, click the upload link in theManage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave.ResultsThe Licensing dialog box displays all license details for the cluster.What to do nextSee Displaying License Features and Details"
    },
    {
      "Heading": "Upgrading, Extending, or Downgrading Licenses or Add-Ons",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-upgrading-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Install a newly-purchased license to upgrade your license tier, downgrade a license tier, or extend the licensing term on your cluster or nodes.Unlicense your cluster.Install the new license(s).Unlicense your cluster as described in Unlicensing a Cluster or Add-on.Do not destroy your cluster. Once you complete this procedure, your cluster license level is Starter.Install the new licenses and optionally any add-ons as described in:Manage Prism Element Licenses and Manage Prism Central LicensesResultsThe Prism Element or Prism Central web console Licensing dialog box shows all new license details for the cluster."
    },
    {
      "Heading": "Reclaiming Licenses",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-reclaiming-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Reclaim a license by returning it to your inventory when modifying license assignments or after removing a node from a cluster. You can reclaim and optionally re-apply licenses for nodes in your clusters. This procedure describes how to reclaim licenses where the cluster is not configured with Portal Connection or the cluster is not connected to the internet (also known as dark-site clusters).After you remove a node, you can also move the node to another cluster. Doing so requires using an available license in your inventory. See Installing an Updated License After Adding a Node to a Cluster.You must unlicense your cluster (other than Starter on Nutanix NX Series platforms) when you plan to destroy a cluster. First unlicense the cluster, then destroy the cluster. See Unlicensing a Cluster or Add-on.Return licenses to your inventory when you remove one or more nodes from a cluster. Also, if you move nodes from one cluster to another, first reclaim the licenses, move the nodes, then re-apply the licenses. You can reclaim licenses for nodes in your clusters in cases where you want to make modifications or downgrade licenses. For example, applying an Ultimate license to all nodes in a cluster where some nodes are currently licensed as Pro and some nodes are licensed as Ultimate. You might also want to transition nodes from Ultimate to Pro licensing. See Upgrading, Extending, or Downgrading Licenses or Add-Ons.You do not need to reclaim Starter licenses for Nutanix NX Series platforms. These licenses are automatically applied whenever you create a cluster. "
    },
    {
      "Heading": "Unlicensing a Cluster or Add-on",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-unlicense-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Remove licenses or add-ons from the Prism Element or Prism Central cluster and refund available licenses that have not expired to your account (that is, reclaim all licenses). An unlicensed Nutanix NX Series cluster reverts to the default Starter license.You must unlicense your cluster when you plan to destroy a cluster. First unlicense the cluster as described here, then destroy the cluster.Generate a cluster summary file in the web console. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses, then click Upload File.In the dialog box, browse to the cluster summary file you just generated and select it.Unlicense a cluster or add-on.To completely unlicense a cluster and all add-ons, click Unlicense All, then click Unlicense in the pop-up dialog box.To unlicense an add-on, click the add-on's options menu, click Unlicense then click Unlicense in the pop-up dialog box.Figure. Unlicense Add-OnClick to enlargeClick Next.Click Download License File to download the license file created for the cluster to your browser download folder or directory you specify.Apply the downloaded license file to the cluster.Open Licensing from the gear icon in the web console.Click Manage Licenses, then click the upload link. Browse to the license file you downloaded, select it, and click Save.[Optional] Destroy the cluster. Do not do this step if you are upgrading or downgrading licenses.The Acropolis Advanced Administration Guide describes how to destroy a cluster."
    },
    {
      "Heading": "Manual License Selection",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-manual-license-selection-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "The Manual License Selection feature is available for licensing Prism Element or Prism Central clusters. You can use this feature as part of the manual or dark-site licensing workflow (also known as 3- Step Licensing). The Nutanix support portal shows this feature on the licensing cards after you upload your cluster summary file.It is also available if you are Using Tags to Organize Your Licenses. Manage licenses according to their tag when performing any manual license workflow.In a homogeneous cluster (for example, a cluster consisting of NX Series or Cisco UCS hardware models), you can apply licenses to individual blocks in a cluster with Manual License Selection. In this configuration, you can mix node-licensed blocks and capacity-based licensed blocks in a cluster. (A block consists of one or more nodes in a single hardware enclosure.)Manual License Selection is not available for:Dark-site clusters where you are trying to mix AOS license levels in a cluster (for example, applying a mix of Ultimate and Pro licenses)The 1-click licensing workflow (where the Portal Connection API is configured).Applying a License by Manual License Selection (Node)Manually select specific node licenses to install on clusters where the Portal Connection API not configured.Applying a License by Manual License Selection (CBL)Manually select specific capacity-based licenses to install on clusters where 1-Click Licensing is not configured. This function is useful if you wish to select licenses with specific terms instead of utilizing licenses selected by default.Applying a License by Manual License Selection (Node)Manually select specific node licenses to install on clusters where the Portal Connection API not configured.This procedure describes the 3-Step Licensing procedure. See also:Manual License SelectionNutanix Support Portal Licenses PageUsing Tags to Organize Your LicensesInstalling or Configuring an Add-On License In the web console, generate a cluster summary file. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Using Tags to Organize Your Licenses: In the Choose License Tags drop-down menu, select a tag name to associate the licenses you are applying here with a tag. Otherwise, selectAll Licenses.The portal displays this drop-down menu only if you have created tags.Click Upload File, browse to the cluster summary file you generated, and select it. Then clickNext.The portal displays license cards with available licenses. Add-ons not associated with your account appear unavailable. For example, your license level might not have the Data Encryption add-on feature.If you click Dark Sites to manually install a license on a cluster that is not connected to the Internet, collect your cluster information as described in Getting Cluster Summary Information Manuallyand return to this step.Click Select License in theAcropolis card, then click the manually manage licenses link.Figure. manually manage licenses Example Click to enlargeThe portal displays the Manual Selection for Acropolis dialog box. From this dialog box, you can select licenses according to the licensing types in your inventory: node/block licenses or capacity-based licenses (CBL), or both. This image shows both license types as available. If your account only contains one license type (for example, node), the other license type is not shown.Figure. Node and Capacity-Based LicensesClick to enlargeSelect the Node Licenses license type to apply to each block, then click Next.The next window lets you filter, select, and apply the licenses. The next Select a Filter By option: license expiration date and by license level (Ultimate, Pro, and so on)If you do not filter by a license level and different license levels are available, the cluster and each node in the cluster defaults to the minimum feature set enabled by the lowest license level.Expand Node Licenses and select the number of licenses to apply.For example, if you have 7 node licenses, you can choose to distribute them across license levels or apply them all to a single license.Figure. Node LicensesClick to enlargeClick Save.Click Next to see Summary page of licenses to be updated on your cluster.Click Generate License File to download the license file created for the cluster to your browser download folder or directory you specify.In the web console, click the Upload link in theManage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks.Applying a License by Manual License Selection (CBL)Manually select specific capacity-based licenses to install on clusters where 1-Click Licensing is not configured. This function is useful if you wish to select licenses with specific terms instead of utilizing licenses selected by default.This procedure assumes that you have purchased licenses and describes the 3-Step Licensing procedure. See also: AOS Capacity-Based LicensingManual License SelectionNutanix Support Portal Licenses PageUsing Tags to Organize Your LicensesInstalling or Configuring an Add-On LicenseIn the web console, generate a cluster summary file. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Using Tags to Organize Your Licenses: In the Choose License Tags drop-down menu, select a tag name to associate the licenses you are applying here with a tag. Otherwise, select All Licenses.The portal displays this drop-down menu only if you have created tags.Click Upload File, browse to the cluster summary file you generated, and select it. Then click Next.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear unavailable. For example, your license level might not have the Data Encryption add-on feature.If you click Dark Sites to manually install a license on a cluster that is not connected to the Internet, collect your cluster information as described in  and return to this step.Click Select License in the Acropolis card, then click the manually manage licenses link in Select License Level.Figure. manually manage licenses Example Click to enlargeThe portal displays the Manual Selection for Acropolis dialog box. From this dialog box, you can select licenses according to the licensing types in your inventory: node/block licenses or capacity-based licenses (CBL; CPU cores and flash), or both. This image shows both license types as available. If your account only contains one license type (for example, capacity-based), the other license type is not displayed.Figure. Node and Capacity-Based LicensesClick to enlargeSelect the capacity-based license type to apply to each block, then click Next.The next window lets you filter, select, and apply the licenses.Select a Filter By option: license expiration date and by license level (Ultimate, Pro, and so on)If you do not filter by a license level and different license levels are available, the cluster and each node in the cluster defaults to the minimum feature set enabled by the lowest license level.Expand TiB Flash Licenses and select the specific Flash licenses to apply.For example, if you have 7 Flash licenses, you can choose to distribute them across license levels or apply them all to a single license. Figure. TiB Flash LicensesClick to enlargeExpand Core licenses and select the specific CPU core licenses to apply.For example, if you have 116 Core licenses, you can choose to distribute them across license levels or apply them all to a single license. Figure. Core licensesClick to enlargeClick Save.Click Next to see Summary page of licenses to apply to your cluster.The portal displays a table showing the License ID, Quantity, Licensing Metric (TiB Flash or Core), and so on.Click Generate License File to download the license file created for the cluster to your browser download folder or directory you specify.In the web console, click the Upload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and click Save to upload it to your cluster.ResultsThe web console Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks."
    },
    {
      "Heading": "Applying a License by Manual License Selection (Node)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-install-manage-node-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Manually select specific node licenses to install on clusters where the Portal Connection API not configured.This procedure describes the 3-Step Licensing procedure. See also:Manual License SelectionNutanix Support Portal Licenses PageUsing Tags to Organize Your LicensesInstalling or Configuring an Add-On License In the web console, generate a cluster summary file. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Using Tags to Organize Your Licenses: In the Choose License Tags drop-down menu, select a tag name to associate the licenses you are applying here with a tag. Otherwise, selectAll Licenses.The portal displays this drop-down menu only if you have created tags.Click Upload File, browse to the cluster summary file you generated, and select it. Then clickNext.The portal displays license cards with available licenses. Add-ons not associated with your account appear unavailable. For example, your license level might not have the Data Encryption add-on feature.If you click Dark Sites to manually install a license on a cluster that is not connected to the Internet, collect your cluster information as described in Getting Cluster Summary Information Manuallyand return to this step.Click Select License in theAcropolis card, then click the manually manage licenses link.Figure. manually manage licenses Example Click to enlargeThe portal displays the Manual Selection for Acropolis dialog box. From this dialog box, you can select licenses according to the licensing types in your inventory: node/block licenses or capacity-based licenses (CBL), or both. This image shows both license types as available. If your account only contains one license type (for example, node), the other license type is not shown.Figure. Node and Capacity-Based LicensesClick to enlargeSelect the Node Licenses license type to apply to each block, then click Next.The next window lets you filter, select, and apply the licenses. The next Select a Filter By option: license expiration date and by license level (Ultimate, Pro, and so on)If you do not filter by a license level and different license levels are available, the cluster and each node in the cluster defaults to the minimum feature set enabled by the lowest license level.Expand Node Licenses and select the number of licenses to apply.For example, if you have 7 node licenses, you can choose to distribute them across license levels or apply them all to a single license.Figure. Node LicensesClick to enlargeClick Save.Click Next to see Summary page of licenses to be updated on your cluster.Click Generate License File to download the license file created for the cluster to your browser download folder or directory you specify.In the web console, click the Upload link in theManage Licenses dialog box.Browse to the license file you downloaded, select it, and clickSave to upload it to your cluster.ResultsThe Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks."
    },
    {
      "Heading": "Applying a License by Manual License Selection (CBL)",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-install-manage-cbl-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Manually select specific capacity-based licenses to install on clusters where 1-Click Licensing is not configured. This function is useful if you wish to select licenses with specific terms instead of utilizing licenses selected by default.This procedure assumes that you have purchased licenses and describes the 3-Step Licensing procedure. See also: AOS Capacity-Based LicensingManual License SelectionNutanix Support Portal Licenses PageUsing Tags to Organize Your LicensesInstalling or Configuring an Add-On LicenseIn the web console, generate a cluster summary file. See Downloading a Cluster Summary File From Your Cluster.Upload the cluster summary file to the Nutanix support portal.Click Support Portal, log on to the Nutanix Support Portal, and click Products > Licenses > Cluster Usage.Click Manage Licenses.If you have tagged your licenses as described in Using Tags to Organize Your Licenses: In the Choose License Tags drop-down menu, select a tag name to associate the licenses you are applying here with a tag. Otherwise, select All Licenses.The portal displays this drop-down menu only if you have created tags.Click Upload File, browse to the cluster summary file you generated, and select it. Then click Next.The portal displays license cards where available licenses are shown. Add-ons not associated with your account appear unavailable. For example, your license level might not have the Data Encryption add-on feature.If you click Dark Sites to manually install a license on a cluster that is not connected to the Internet, collect your cluster information as described in  and return to this step.Click Select License in the Acropolis card, then click the manually manage licenses link in Select License Level.Figure. manually manage licenses Example Click to enlargeThe portal displays the Manual Selection for Acropolis dialog box. From this dialog box, you can select licenses according to the licensing types in your inventory: node/block licenses or capacity-based licenses (CBL; CPU cores and flash), or both. This image shows both license types as available. If your account only contains one license type (for example, capacity-based), the other license type is not displayed.Figure. Node and Capacity-Based LicensesClick to enlargeSelect the capacity-based license type to apply to each block, then click Next.The next window lets you filter, select, and apply the licenses.Select a Filter By option: license expiration date and by license level (Ultimate, Pro, and so on)If you do not filter by a license level and different license levels are available, the cluster and each node in the cluster defaults to the minimum feature set enabled by the lowest license level.Expand TiB Flash Licenses and select the specific Flash licenses to apply.For example, if you have 7 Flash licenses, you can choose to distribute them across license levels or apply them all to a single license. Figure. TiB Flash LicensesClick to enlargeExpand Core licenses and select the specific CPU core licenses to apply.For example, if you have 116 Core licenses, you can choose to distribute them across license levels or apply them all to a single license. Figure. Core licensesClick to enlargeClick Save.Click Next to see Summary page of licenses to apply to your cluster.The portal displays a table showing the License ID, Quantity, Licensing Metric (TiB Flash or Core), and so on.Click Generate License File to download the license file created for the cluster to your browser download folder or directory you specify.In the web console, click the Upload link in the Manage Licenses dialog box.Browse to the license file you downloaded, select it, and click Save to upload it to your cluster.ResultsThe web console Licensing page displays all license details for the cluster.What to do nextSee Displaying License Features and Details and Other Common License Management Tasks."
    },
    {
      "Heading": "Displaying License Features and Details",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-display-features-t.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "In the web console, click the gear icon, and select Licensing.Click the license certificate (Starter, Pro, Ultimate) to show the feature list for your license. For example:Figure. License FeaturesClick to enlargeScroll down to see other features, then click Back to return to the licensing page.Click Show Licenses to show a list of all licenses and their details.Figure. License DetailsClick to enlargeScroll down to see all licenses, then click Back to return to the licensing page."
    },
    {
      "Heading": "License Warnings in the Web Console",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-warnings-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Most license warnings in the web console are related to license violations or licenses that are about to expire or expired. In most cases, the resolution is to extend or purchase licenses.Starter licenses never expire for Nutanix NX and third party OEM hardware appliances. Go to Licensing in the web console to check your Starter license expiration status.Pro and Ultimate licenses do have an expiration date and the web console alerts you 60 days before expiration.If you attempt to use features not available in your cluster's license level, a Warning is issued. Please upgrade your license level if you require continued access to Pro or Ultimate features.If a cluster includes nodes with different license levels, the cluster and each node in the cluster defaults to the minimum feature set enabled by the lowest license level. For example, if two nodes in the cluster have Pro licenses and two nodes in the same have Ultimate licenses, all nodes will effectively have Pro licenses and access to that feature set only. Attempts to access Ultimate features in this case result in a Warning in the web console.If you are using a Prism Pro trial license, the warning shows the expiration date and number of days left in the trial period. Typically, the trial period is 60 days. The license name will also display as a Pro_Trial license level.During upgrade of AOS, the Prism web console might incorrectly display a license violation alert. After you complete the upgrade, the alert is not displayed.Generating a cluster summary file through the Prism web console, nCLI commands (download-cluster-info), or PowerShell commands (Get-NTNXClusterLicenseInfo and Get-NTNXClusterLicenseInfoFile) initiates the cluster licensing process. You might observe a Licensing Status: In Process alert message in the web console or log files in this case."
    },
    {
      "Heading": "Nutanix Calm License Warnings in the Web Console",
      "Link": "https://portal.nutanix.com/#/page/docs/details?targetId=Licensing-Guide:lic-licensing-calm-warnings-c.html",
      "Document Name": "Nutanix Licensing Guide",
      "Content": "Most license warnings in the web console are related to license violations or licenses that are about to expire or have expired. In most cases, the resolution is to extend or purchase licenses.Nutanix Calm licenses do have an expiration date and the web console alerts you 60 days before expiration.An alert is generated providing the number of license packs required for compliance. For example, The cluster needs 1 additional license pack. Please expand Calm capacity with 1 pack.If the license pack is already expired an alert is generated.Note: Any powered off VMs are also counted for license calculation.If a VM is deleted manually from a cloud provider without deleting the app from Calm, it will be counted for license calculation.After applying a new license, you can wait for the next scheduled Nutanix Cluster Checks to run and only after that the alerts are auto-resolved."
    }
  ]
}